xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
        /* Synchronous Noise Reduction Setting */
        CTSU.CTSUSDPRS.BYTE = ((CTSU_SOFF_ON << 6) | (CTSU_PRMODE_62_PULSES << 4) | CTSU_PRRATIO_RECOMMEND);

        /* High Pass Noise Reduction- ALWAYS 0x30 as per HW Manual */
        CTSU.CTSUDCLKC.BYTE = ((CTSU_SSCNT << 4) | CTSU_SSMOD);

        /* Sensor Stabilization- ALWAYS 0x10 as per HW Manual */
        CTSU.CTSUSST.BYTE = (CTSU_SST_RECOMMEND);

        if (CTSU_CORRECTION_INIT == g_ctsu_correction_info.status)
        {
            ctsu_correction_process(p_instance_ctrl);
        }

        /* Since CLK is rewritten by correction, set here. */
        CTSU.CTSUCR1.BYTE |= (uint8_t) (CTSU_CFG_PCLK_DIVISION << 4);
#endif
    }

#if (BSP_FEATURE_CTSU_VERSION == 2)
    if (CTSU_MODE_MUTUAL_CFC_SCAN != p_cfg->md)
    {
        /* Set power on */
        CTSU.CTSUCRA.BIT.CSW = CTSU_CSW_ON;
        CTSU.CTSUCRA.BIT.PON = CTSU_PON_ON;
        R_BSP_SoftwareDelay(30, BSP_DELAY_MICROSECS);
    }

 #if (CTSU_CFG_NUM_CFC != 0)
    else
    {
        R_CTSU->CTSUCALIB_b.CFCRDMD = 1;
        R_CTSU->CTSUCRA_b.CFCON     = 1;
        R_BSP_SoftwareDelay(30, BSP_DELAY_UNITS_MICROSECONDS);
    }
 #endif

    /* High resolution pulse mode  */
    CTSU.CTSUCRA.BIT.SDPSEL    = 1;
    CTSU.CTSUCRA.BIT.PCSEL     = 1;
    CTSU.CTSUCRB.BIT.SST       = CTSU_SST_RECOMMEND;
    CTSU.CTSUCALIB.BIT.CCOCLK  = 0;
    CTSU.CTSUCALIB.BIT.SUCLKEN = 0;

    if (CTSU_MODE_MUTUAL_CFC_SCAN != p_cfg->md)
    {
 #if (CTSU_CFG_TEMP_CORRECTION_SUPPORT == 1)
        if (CTSU_MODE_CORRECTION_SCAN == p_cfg->md)
        {
            g_ctsu_correction_info.scan_index = CTSU_CORRECTION_POINT_NUM;
        }
 #endif
        if (CTSU_CORRECTION_INIT == g_ctsu_correction_info.status)
        {
            ctsu_correction_process(p_instance_ctrl);
        }
    }

 #if (CTSU_CFG_NUM_CFC != 0)
    else
    {
        ctsu_corrcfc_process(p_instance_ctrl);
    }
    p_instance_ctrl->p_corrcfc_info = &g_ctsu_corrcfc_info;
 #endif

    CTSU.CTSUCRA.BIT.LOAD      = 1;
    CTSU.CTSUCRB.BIT.SSCNT      = 1;
    CTSU.CTSUCALIB.BIT.SUCARRY  = 0;
    CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
    CTSU.CTSUCALIB.BIT.CCOCLK   = 1;
    CTSU.CTSUCALIB.BIT.TSOC     = 0;
    CTSU.CTSUCALIB.BIT.SUCLKEN  = 1;

    /* Read SUADJD byte */
    suadj[0] = CTSU.CTSUTRIMA.BIT.SUADJD;

    /* Adjust multi freq */
    suadj[1] = (uint16_t) ((suadj[0] * (CTSU_CFG_SUMULTI1 + 1)) / (CTSU_CFG_SUMULTI0 + 1));
    suadj[2] = (uint16_t) ((suadj[0] * (CTSU_CFG_SUMULTI2 + 1)) / (CTSU_CFG_SUMULTI0 + 1));

    /* Adjust SSCNT setting */
    suadj[0] = (uint16_t) (suadj[0] - (CTSU_SUADJ_SSCNT_ADJ * CTSU.CTSUCRB.BIT.SSCNT));
    suadj[1] = (uint16_t) (suadj[1] - (CTSU_SUADJ_SSCNT_ADJ * CTSU.CTSUCRB.BIT.SSCNT));
    suadj[2] = (uint16_t) (suadj[2] - (CTSU_SUADJ_SSCNT_ADJ * CTSU.CTSUCRB.BIT.SSCNT));

    /* Set CTSUSUCLK register */
    CTSU.CTSUCRA.BIT.SDPSEL = 0;
    CTSU.CTSUSUCLKA.BIT.SUADJ0   = suadj[0];
    CTSU.CTSUSUCLKA.BIT.SUMULTI0 = CTSU_CFG_SUMULTI0;

    CTSU.CTSUSUCLKA.BIT.SUADJ1   = suadj[1];
    CTSU.CTSUSUCLKA.BIT.SUMULTI1 = CTSU_CFG_SUMULTI1;

    CTSU.CTSUSUCLKB.BIT.SUADJ2   = suadj[2];
    CTSU.CTSUSUCLKB.BIT.SUMULTI2 = CTSU_CFG_SUMULTI2;

    CTSU.CTSUCRA.BIT.SDPSEL = 1;

 #if (CTSU_CFG_AUTO_JUDGE_ENABLE == 1)
    if (1 == p_instance_ctrl->p_ctsu_cfg->ajfen)
    {
        /* Fixed parameter setting for automatic judgement */
        CTSU.CTSUAJCR.BIT.TLOT   = p_instance_ctrl->p_ctsu_cfg->tlot;
        CTSU.CTSUAJCR.BIT.THOT   = p_instance_ctrl->p_ctsu_cfg->thot;
        CTSU.CTSUAJCR.BIT.JC     = p_instance_ctrl->p_ctsu_cfg->jc;

        p_instance_ctrl->blini_flag = 1;
    }
 #endif
#endif

#if (BSP_FEATURE_CTSU_VERSION == 1)
 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
       /* Initialize diagnosis information */
        p_instance_ctrl->p_diag_info    = &g_ctsu_diag_info;
        g_ctsu_diag_info.state          = CTSU_DIAG_INIT;
        g_ctsu_diag_info.ctsuwr.ctsussc = 0;
        g_ctsu_diag_info.ctsuwr.ctsuso0 = 0;
        g_ctsu_diag_info.ctsuwr.ctsuso1 = 0;
        g_ctsu_diag_info.loop_count     = 0;
        g_ctsu_diag_info.scanbuf.sen    = 0;
        g_ctsu_diag_info.scanbuf.ref    = 0;
        g_ctsu_diag_info.correct_data   = 0;
        g_ctsu_diag_info.icomp          = 0;
        g_ctsu_diag_info.cco_high       = 0;
        g_ctsu_diag_info.cco_low        = 0;
        g_ctsu_diag_info.sscg           = 0;
        g_ctsu_diag_info.dac_cnt[0]     = 0;
        g_ctsu_diag_info.dac_cnt[1]     = 0;
        g_ctsu_diag_info.dac_cnt[2]     = 0;
        g_ctsu_diag_info.dac_cnt[3]     = 0;
        g_ctsu_diag_info.dac_cnt[4]     = 0;
        g_ctsu_diag_info.dac_cnt[5]     = 0;
        g_ctsu_diag_info.so0_4uc_val    = 0;
        g_ctsu_diag_info.dac_init       = 0;
        g_ctsu_diag_info.tuning         = CTSU_TUNING_INCOMPLETE;
        g_ctsu_diag_info.tuning_diff    = 0;
    }
 #endif
#endif

#if (BSP_FEATURE_CTSU_VERSION == 2)
 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        p_instance_ctrl->p_diag_info = &g_ctsu_diag_info;
        g_ctsu_diag_info.lvmode      = CTSU_CFG_LOW_VOLTAGE_MODE;
        g_ctsu_diag_info.state       = CTSU_DIAG_INIT;
    }
    else
    {
        /* Once chac is set, it will not be set after that */
        if ((0 == g_ctsu_diag_info.chaca) && (0 == g_ctsu_diag_info.chacb))
        {
            /* From the CHAC information configured in the normal measurement,                                  */
            /* find the minimum TS pin on the CTSU peripheral for the OverCuurent test and clock recovery test. */

            /* Get CHACA register info */
            ((uint8_t *) &(g_ctsu_diag_info.chaca))[0] = p_instance_ctrl->p_ctsu_cfg->ctsuchac0;
            ((uint8_t *) &(g_ctsu_diag_info.chaca))[1] = p_instance_ctrl->p_ctsu_cfg->ctsuchac1;
            ((uint8_t *) &(g_ctsu_diag_info.chaca))[2] = p_instance_ctrl->p_ctsu_cfg->ctsuchac2;
            ((uint8_t *) &(g_ctsu_diag_info.chaca))[3] = p_instance_ctrl->p_ctsu_cfg->ctsuchac3;

            /* Get CHACB register info */
            g_ctsu_diag_info.chacb = (uint32_t) (p_instance_ctrl->p_ctsu_cfg->ctsuchac4);

