xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
            /* Get the number of measurable elements from enabled CHACA */
            if (0 != g_ctsu_diag_info.chaca)
            {
                /* Get the number of measurable elements from enabled CHACA */
                for (i = 0; i < CTSU_DIAG_CHACA_TSMAX; i++)
                {
                    if ((g_ctsu_diag_info.chaca >> i) & (uint32_t) 0x00000001)
                    {
                        g_ctsu_diag_info.chaca = (uint32_t) (0x00000001 << i);
                        g_ctsu_diag_info.chacb = 0;
                        break;
                    }
                }
            }
            else                       /* Check the measurable elements from enabled CHACB. */
            {
                for (i = 0; i < 8; i++)
                {
                    /* Get the number of measurable elements from enabled CHACB */
                    if ((g_ctsu_diag_info.chacb >> i) & (uint32_t) 0x00000001)
                    {
                        g_ctsu_diag_info.chaca = 0;
                        g_ctsu_diag_info.chacb = (uint32_t) (0x00000001 << i);
                        break;
                    }
                }
            }
        }
    }
 #endif
#endif

    p_instance_ctrl->p_correction_info = &g_ctsu_correction_info;
    p_instance_ctrl->rd_index          = 0;
    p_instance_ctrl->wr_index          = 0;
    p_instance_ctrl->state             = CTSU_STATE_IDLE;

    p_instance_ctrl->p_callback        = p_cfg->p_callback;
    p_instance_ctrl->p_context         = p_cfg->p_context;
    p_instance_ctrl->p_callback_memory = NULL;

    p_instance_ctrl->serial_tuning_enable     = 0;
    p_instance_ctrl->serial_tuning_mutual_cnt = 0;

#if defined(CTSU_CFG_TARGET_VALUE_QE_SUPPORT)
    p_instance_ctrl->tuning_self_target_value   = p_cfg->tuning_self_target_value;
    p_instance_ctrl->tuning_mutual_target_value = p_cfg->tuning_mutual_target_value;
#else
    p_instance_ctrl->tuning_self_target_value   = CTSU_TUNING_VALUE_SELF;
    p_instance_ctrl->tuning_mutual_target_value = CTSU_TUNING_VALUE_MUTUAL;
#endif

    /* Mark driver as open */
    p_instance_ctrl->open = CTSU_OPEN;

    return err;
}

/*******************************************************************************************************************//**
 * @brief This function should be called each time a periodic timer expires.
 * If initial offset tuning is enabled, The first several calls are used to tuning for the sensors.
 * Before starting the next scan, first get the data with R_CTSU_DataGet().
 * If a different control block scan should be run, check the scan is complete before executing.
 * Implements @ref ctsu_api_t::scanStart.
 *
 * Example:
 * @snippet r_ctsu_example.c R_CTSU_ScanStart
 *
 * @retval FSP_SUCCESS              CTSU successfully configured.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING    Scanning this instance or other.
 * @retval FSP_ERR_CTSU_NOT_GET_DATA    The previous data has not been retrieved by DataGet.
 **********************************************************************************************************************/
fsp_err_t R_CTSU_ScanStart (ctsu_ctrl_t * const p_ctrl)
{
    fsp_err_t              err             = FSP_SUCCESS;
    ctsu_instance_ctrl_t * p_instance_ctrl = (ctsu_instance_ctrl_t *) p_ctrl;
#if (BSP_FEATURE_CTSU_VERSION == 1)
    uint8_t                temp;
#endif
#if (CTSU_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ERROR_RETURN(CTSU_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif
    if (CTSU_CAP_SOFTWARE == p_instance_ctrl->cap)
    {
#if (BSP_FEATURE_CTSU_VERSION == 2)
        /* Can be checked if the previous measurement was a software trigger */
        if (0 == (0x02 & CTSU.CTSUCRA.LONG))
        {
            FSP_ERROR_RETURN(0x01 != (CTSU.CTSUCRA.LONG & 0x01), FSP_ERR_CTSU_SCANNING);
        }
#endif
#if (BSP_FEATURE_CTSU_VERSION == 1)
        /* Can be checked if the previous measurement was a software trigger */
        if (0 == (0x02 & CTSU.CTSUCR0.BYTE))
        {
            FSP_ERROR_RETURN(0x01 != (CTSU.CTSUCR0.BYTE & 0x01), FSP_ERR_CTSU_SCANNING);
        }
#endif
    }

    FSP_ERROR_RETURN(CTSU_STATE_SCANNED != p_instance_ctrl->state, FSP_ERR_CTSU_NOT_GET_DATA);

    gp_ctsu_isr_context = p_instance_ctrl;

#if (CTSU_CFG_DTC_SUPPORT_ENABLE == 1)
 #if (CTSU_CFG_AUTO_JUDGE_ENABLE == 0)
    err = ctsu_transfer_configure(p_instance_ctrl);
 #else
    err = ctsu_transfer_auto_configure(p_instance_ctrl);
 #endif
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#endif


#if (BSP_FEATURE_CTSU_VERSION == 2)

    if (CTSU_CAP_SOFTWARE == p_instance_ctrl->cap)
    {
        /* specify Software trigger usage */
        CTSU.CTSUCRA.BIT.CAP = 0;
        CTSU.CTSUCRA.BIT.SNZ = 0;
    }
    else
    {
        /* specify external trigger usage and enable power saving */
        CTSU.CTSUCRA.BIT.CAP = 1;
        CTSU.CTSUCRA.BIT.SNZ = 1;
        CTSU.CTSUCRA.BIT.STRT = 0; // To write CTSUCR1
    }

    /* Write CTSU Control Register 1 and save mode */

    if ((CTSU_MODE_CORRECTION_SCAN != p_instance_ctrl->md) &&
        (CTSU_MODE_DIAGNOSIS_SCAN != p_instance_ctrl->md))
    {
        CTSU.CTSUCRA.BIT.TXVSEL = (p_instance_ctrl->p_ctsu_cfg->txvsel << 1 ) | p_instance_ctrl->p_ctsu_cfg->txvsel2;

        CTSU.CTSUCRA.BIT.ATUNE1 = ((p_instance_ctrl->ctsucr1 >> 3) & 0x01);
        CTSU.CTSUCRA.BIT.MD0 = ((p_instance_ctrl->ctsucr1 >> 6) & 0x01);
        CTSU.CTSUCRA.BIT.MD1 = ((p_instance_ctrl->ctsucr1 >> 7) & 0x01);
        CTSU.CTSUCRA.BIT.ATUNE2 = ((p_instance_ctrl->ctsucr2 >> 1) & 0x01);
        CTSU.CTSUCRA.BIT.POSEL = ((p_instance_ctrl->ctsucr2 >> 4) & 0x03);
        if (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->md)
        {
            CTSU.CTSUCRB.BIT.SST    = CTSU_SST_RECOMMEND_CURRENT;
            CTSU.CTSUCRA.BIT.DCMODE = 1;
            CTSU.CTSUCRA.BIT.DCBACK = 1;
            CTSU.CTSUMCH.BIT.MCA0   = 1;
            CTSU.CTSUMCH.BIT.MCA1   = 0;
            CTSU.CTSUMCH.BIT.MCA2   = 0;
            CTSU.CTSUMCH.BIT.MCA3   = 0;
        }
        else
        {
            CTSU.CTSUCRB.BIT.SST    = CTSU_SST_RECOMMEND;
            CTSU.CTSUCRA.BIT.DCMODE = 0;
            CTSU.CTSUCRA.BIT.DCBACK = 0;
            CTSU.CTSUMCH.BIT.MCA0   = 1;
 #if (CTSU_CFG_NUM_SUMULTI >= 2)
            CTSU.CTSUMCH.BIT.MCA1 = 1;
 #endif
 #if (CTSU_CFG_NUM_SUMULTI >= 3)
            CTSU.CTSUMCH.BIT.MCA2 = 1;
 #endif
        }

        /* Write Channel setting */
        CTSU.CTSUCHACA.LONG  = (uint32_t)((p_instance_ctrl->ctsuchac3 << 24) |
                                          (p_instance_ctrl->ctsuchac2 << 16) |
                                          (p_instance_ctrl->ctsuchac1 << 8 ) |
                                          (p_instance_ctrl->ctsuchac0));
        CTSU.CTSUCHACB.LONG  = (uint32_t)(p_instance_ctrl->ctsuchac4);

        CTSU.CTSUCHTRCA.LONG  = (uint32_t)((p_instance_ctrl->ctsuchtrc3 << 24) |
                                           (p_instance_ctrl->ctsuchtrc2 << 16) |
                                           (p_instance_ctrl->ctsuchtrc1 << 8 ) |
                                           (p_instance_ctrl->ctsuchtrc0));
        CTSU.CTSUCHTRCB.LONG  = (uint32_t)(p_instance_ctrl->ctsuchtrc4);

