xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    }

 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        err = (fsp_err_t)ctsu_diag_scan_start2(p_instance_ctrl);
    }
 #endif
 #if (CTSU_CFG_TEMP_CORRECTION_SUPPORT == 1)
    if (CTSU_MODE_CORRECTION_SCAN == p_instance_ctrl->md)
    {
        CTSU.CTSUCRB.BIT.SST = CTSU_SST_RECOMMEND;
        ctsu_correction_scan_start();
  #if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
        /* Disable automatic correction during temperature correction */
        CTSU.CTSUOPT.BIT.CCOCFEN = 0;
  #endif
    }
 #endif

 #if (CTSU_CFG_AUTO_JUDGE_ENABLE == 1)
    if (CTSU_TUNING_COMPLETE == p_instance_ctrl->tuning)
    {
        /* Enable / disable switching of automatic judgement */
        CTSU.CTSUOPT.BIT.MTUCFEN = p_instance_ctrl->p_ctsu_cfg->mtucfen;
        CTSU.CTSUOPT.BIT.AJFEN   = p_instance_ctrl->p_ctsu_cfg->ajfen;

        if (1 == p_instance_ctrl->p_ctsu_cfg->ajfen)
        {
            /* Setting the number of moving averages and the number of baseline averages for automatic judgement */
            CTSU.CTSUAJCR.BIT.AJMMAT = p_instance_ctrl->ajmmat;
            CTSU.CTSUAJCR.BIT.AJBMAT = p_instance_ctrl->ajbmat;
        }
    }

    if (1 == p_instance_ctrl->blini_flag)
    {
        /* Set blini to 1 at the first judgement of automatic judgement */
        CTSU.CTSUAJCR.BIT.BLINI = 1;
    }
 #endif

 #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
    /* Parameter setting for multiple electrode connection */
    CTSU.CTSUCALIB.BIT.TSOD   = p_instance_ctrl->tsod;
    CTSU.CTSUCALIB.BIT.IOCSEL = 0;
    if (1 == p_instance_ctrl->tsod)
    {
        /* When using MEC, MD0 bit is set to single scan mode. */
        CTSU.CTSUCRA.BIT.MD0  = 0;
        CTSU.CTSUMCH.BIT.MCH0 = p_instance_ctrl->mec_ts;

        /* Set MCH1 when using both MEC and Active Shield.*/
        if((0 != p_instance_ctrl->ctsuchtrc0)
                || (0 != p_instance_ctrl->ctsuchtrc1)
                || (0 != p_instance_ctrl->ctsuchtrc2)
                || (0 != p_instance_ctrl->ctsuchtrc3)
                || (0 != p_instance_ctrl->ctsuchtrc4))
        {
            CTSU.CTSUMCH.BIT.MCH1 = p_instance_ctrl->mec_shield_ts;
        }
    }
 #endif

    p_instance_ctrl->state = CTSU_STATE_SCANNING;

    /* Set CTSU_STRT bit to start scan */
    CTSU.CTSUCRA.BIT.STRT = 1;
#endif
#if (BSP_FEATURE_CTSU_VERSION == 1)

    if (CTSU_CAP_SOFTWARE == p_instance_ctrl->cap)
    {
        /* specify Software trigger usage */
        CTSU.CTSUCR0.BIT.CTSUCAP = 0;
        CTSU.CTSUCR0.BIT.CTSUSNZ = 0;
    }
    else
    {
        /* specify external trigger usage and enable power saving */
        CTSU.CTSUCR0.BIT.CTSUCAP = 1;
        CTSU.CTSUCR0.BIT.CTSUSNZ = 1;
        CTSU.CTSUCR0.BIT.CTSUSTRT = 0; // To write CTSUCR1
    }


    if (CTSU_MODE_DIAGNOSIS_SCAN != p_instance_ctrl->md)
    {
        temp            = (uint8_t) (CTSU.CTSUCR1.BYTE & ~(CTSU_CR1_MODIFY_BIT));
        CTSU.CTSUCR1.BYTE = (uint8_t) (temp | (p_instance_ctrl->ctsucr1 & CTSU_CR1_MODIFY_BIT)); // MD1, MD0, ATUNE1

 #if BSP_FEATURE_CTSU_HAS_TXVSEL
        CTSU.CTSUCR0.BIT.CTSUTXVSEL = p_instance_ctrl->p_ctsu_cfg->txvsel;
 #endif

        /* Write Channel setting */
        CTSU.CTSUCHAC0.BYTE = p_instance_ctrl->ctsuchac0;
        CTSU.CTSUCHAC1.BYTE = p_instance_ctrl->ctsuchac1;
 #if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 3)
        CTSU.CTSUCHAC2.BYTE = p_instance_ctrl->ctsuchac2;
 #endif
 #if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 4)
        CTSU.CTSUCHAC3.BYTE = p_instance_ctrl->ctsuchac3;
 #endif
 #if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 5)
        CTSU.CTSUCHAC4.BYTE = p_instance_ctrl->ctsuchac4;
 #endif

 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        CTSU.CTSUCHTRC0.BYTE = p_instance_ctrl->ctsuchtrc0;
        CTSU.CTSUCHTRC1.BYTE = p_instance_ctrl->ctsuchtrc1;
  #if (BSP_FEATURE_CTSU_CTSUCHTRC_REGISTER_COUNT >= 3)
        CTSU.CTSUCHTRC2.BYTE = p_instance_ctrl->ctsuchtrc2;
  #endif
  #if (BSP_FEATURE_CTSU_CTSUCHTRC_REGISTER_COUNT >= 4)
        CTSU.CTSUCHTRC3.BYTE = p_instance_ctrl->ctsuchtrc3;
  #endif
  #if (BSP_FEATURE_CTSU_CTSUCHTRC_REGISTER_COUNT >= 5)
        CTSU.CTSUCHTRC4.BYTE = p_instance_ctrl->ctsuchtrc4;
  #endif
 #endif
    }

 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        ctsu_diag_scan_start1(p_instance_ctrl);
    }
 #endif

    p_instance_ctrl->state = CTSU_STATE_SCANNING;

    /* Set CTSU_STRT bit to start scan */
    CTSU.CTSUCR0.BIT.CTSUSTRT = 1;
#endif



    return err;
}

/*******************************************************************************************************************//**
 * @brief This function gets the sensor values as scanned by the CTSU.
 * If initial offset tuning is enabled, The first several calls are used to tuning for the sensors.
 * Implements @ref ctsu_api_t::dataGet.
 *
 * Example:
 * @snippet r_ctsu_example.c R_CTSU_DataGet
 *
 * @retval FSP_SUCCESS              CTSU successfully configured.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING    Scanning this instance.
 * @retval FSP_ERR_CTSU_INCOMPLETE_TUNING      Incomplete initial offset tuning.
 * @retval FSP_ERR_CTSU_DIAG_NOT_YET      Diagnosis of data collected no yet.
 * @retval FSP_ERR_INVALID_MODE           The mode of automatic judgement on is invalid.
 * @retval FSP_ERR_ABORTED                Operate error of Diagnosis ADC data collection ,since ADC use other
 **********************************************************************************************************************/
fsp_err_t R_CTSU_DataGet (ctsu_ctrl_t * const p_ctrl, uint16_t * p_data)
{
    fsp_err_t              err             = FSP_SUCCESS;
    ctsu_instance_ctrl_t * p_instance_ctrl = (ctsu_instance_ctrl_t *) p_ctrl;
    uint16_t               element_id;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_data);
    FSP_ERROR_RETURN(CTSU_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif
    FSP_ERROR_RETURN(CTSU_STATE_SCANNING != p_instance_ctrl->state, FSP_ERR_CTSU_SCANNING);
    FSP_ERROR_RETURN(0 == p_instance_ctrl->p_ctsu_cfg->ajfen, FSP_ERR_INVALID_MODE);

#if (BSP_FEATURE_CTSU_VERSION == 2)
 #if (CTSU_CFG_TEMP_CORRECTION_SUPPORT == 1)
    if (CTSU_MODE_CORRECTION_SCAN == p_instance_ctrl->md)
    {
        err = ctsu_correction_data_get(p_instance_ctrl, p_data);
  #if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
        /* Enable automatic correction after temperature correction is completed */
        CTSU.CTSUOPT.BIT.CCOCFEN = 1;
  #endif
        p_instance_ctrl->state = CTSU_STATE_IDLE;

