xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
                    multi.pri[i] = *(p_instance_ctrl->p_mutual_pri_corr + (element_id * CTSU_CFG_NUM_SUMULTI) + i);
                    multi.snd[i] = *(p_instance_ctrl->p_mutual_snd_corr + (element_id * CTSU_CFG_NUM_SUMULTI) + i);
                }

                ctsu_correction_fleq(&multi,
                                     (p_instance_ctrl->p_mutual_pri_corr + (element_id * CTSU_CFG_NUM_SUMULTI)),
                                     (p_instance_ctrl->p_mutual_snd_corr + (element_id * CTSU_CFG_NUM_SUMULTI)));
 #endif
                for (i = 0; i < CTSU_CFG_NUM_SUMULTI; i++)
                {
                    *p_specific_data = *(p_instance_ctrl->p_mutual_pri_corr + (element_id * CTSU_CFG_NUM_SUMULTI) + i);
                    p_specific_data++;
                    *p_specific_data = *(p_instance_ctrl->p_mutual_snd_corr + (element_id * CTSU_CFG_NUM_SUMULTI) + i);
                    p_specific_data++;
                }
            }
        }
#endif
    }

#if (BSP_FEATURE_CTSU_VERSION == 2)
    else if (CTSU_SPECIFIC_SELECTED_FREQ == specific_data_type)
    {
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
        if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->md)
        {
            for (element_id = 0; element_id < (p_instance_ctrl->num_elements); element_id++)
            {
                *p_specific_data = *(p_instance_ctrl->p_selected_freq_self + element_id);
                p_specific_data++;
            }
        }
 #endif
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
        {
            for (element_id = 0; element_id < (p_instance_ctrl->num_elements); element_id++)
            {
                *p_specific_data = *(p_instance_ctrl->p_selected_freq_mutual + element_id);
                p_specific_data++;
            }
        }
 #endif
    }
#endif
    else
    {
    }

    return err;
}

/*******************************************************************************************************************//**
 * @brief This function inserts the value of the second argument as the measurement result value.
 * Call this function after calling the R_CTSU_DataInsert() function.
 * Implements @ref ctsu_api_t::dataInsert.
 *
 * Example:
 * @snippet r_ctsu_example.c R_CTSU_DataInsert
 *
 * @retval FSP_SUCCESS              CTSU successfully configured.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING    Scanning this instance.
 * @retval FSP_ERR_CTSU_INCOMPLETE_TUNING      Incomplete initial offset tuning.
 **********************************************************************************************************************/
fsp_err_t R_CTSU_DataInsert (ctsu_ctrl_t * const p_ctrl, uint16_t * p_insert_data)
{
    fsp_err_t              err             = FSP_SUCCESS;
    ctsu_instance_ctrl_t * p_instance_ctrl = (ctsu_instance_ctrl_t *) p_ctrl;
    uint16_t               element_id;

#if (CTSU_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_insert_data);
    FSP_ERROR_RETURN(CTSU_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif
    FSP_ERROR_RETURN(CTSU_STATE_SCANNING != p_instance_ctrl->state, FSP_ERR_CTSU_SCANNING);
    FSP_ERROR_RETURN(CTSU_TUNING_INCOMPLETE != p_instance_ctrl->tuning, FSP_ERR_CTSU_INCOMPLETE_TUNING);

#if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
    if (CTSU_MODE_SELF_MULTI_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
    {
        /* Data output */
        for (element_id = 0; element_id < p_instance_ctrl->num_elements; element_id++)
        {
            (p_instance_ctrl->p_self_data + element_id)->int_data = *p_insert_data;
            p_insert_data++;
        }
    }
#endif
#if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
    {
        for (element_id = 0; element_id < p_instance_ctrl->num_elements; element_id++)
        {
            (p_instance_ctrl->p_mutual_pri_data + element_id)->int_data = *p_insert_data;
            p_insert_data++;
            (p_instance_ctrl->p_mutual_snd_data + element_id)->int_data = *p_insert_data;
            p_insert_data++;
        }
    }
#endif

    return err;
}

/*******************************************************************************************************************//**
 * @} (end addtogroup CTSU)
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Private Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Internal ctsu private function.
 **********************************************************************************************************************/

#if (CTSU_CFG_DTC_SUPPORT_ENABLE == 1)
 #if (CTSU_CFG_AUTO_JUDGE_ENABLE == 0)
/***********************************************************************************************************************
 * ctsu_transfer_open
 ***********************************************************************************************************************/
fsp_err_t ctsu_transfer_open (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    dtc_err_t dtc_err;
    uint8_t                 ien_bk;

    /* DTC Open */
    R_DTC_Open();

    dtc_err = R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);

    /* CTSUWR setting */
    g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSUWR;

    dtc_err = R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

    g_ctsu_dtc_info.chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE;
    g_ctsu_dtc_info.src_addr_mode         = DTC_SRC_ADDR_INCR;
    g_ctsu_dtc_info.response_interrupt    = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
  #if (BSP_FEATURE_CTSU_VERSION == 2)
    g_ctsu_dtc_info.dest_addr_mode     = DTC_DES_ADDR_FIXED;
    g_ctsu_dtc_info.data_size          = DTC_DATA_SIZE_LWORD;
    g_ctsu_dtc_info.dest_addr          = (uint32_t) &(CTSU.CTSUSO.LONG);
    g_ctsu_dtc_info.transfer_mode      = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_info.repeat_block_side  = DTC_REPEAT_BLOCK_DESTINATION;
    g_ctsu_dtc_info.block_size         = 1;
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    g_ctsu_dtc_info.dest_addr_mode     = DTC_DES_ADDR_INCR;
    g_ctsu_dtc_info.data_size          = DTC_DATA_SIZE_WORD;
    g_ctsu_dtc_info.dest_addr          = (uint32_t) &(CTSU.CTSUSSC);
    g_ctsu_dtc_info.transfer_mode      = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_info.repeat_block_side  = DTC_REPEAT_BLOCK_DESTINATION;
    g_ctsu_dtc_info.block_size         = 3;
  #endif
    g_ctsu_dtc_info.transfer_count     = 1;
    g_ctsu_dtc_info.source_addr =(uint32_t)p_instance_ctrl->p_ctsuwr;
    g_transfer_info_tx = g_ctsu_dtc_info;
    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;

