xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, &g_transfer_data_tx, &g_ctsu_dtc_info, 0);
    if(dtc_err != DTC_SUCCESS)
    {
        return FSP_ERR_ASSERTION;
    }

    IEN(CTSU,CTSUWR) = ien_bk;
    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSURD;

    R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

    g_ctsu_dtc_info.chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE;
    g_ctsu_dtc_info.src_addr_mode         = DTC_SRC_ADDR_INCR;
    g_ctsu_dtc_info.response_interrupt    =  DTC_INTERRUPT_AFTER_ALL_COMPLETE;

  #if (BSP_FEATURE_CTSU_VERSION == 2)
    g_ctsu_dtc_info.dest_addr_mode     = DTC_DES_ADDR_FIXED;
    g_ctsu_dtc_info.data_size          = DTC_DATA_SIZE_WORD;
    g_ctsu_dtc_info.transfer_mode      = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_info.repeat_block_side  = DTC_REPEAT_BLOCK_SOURCE;
    g_ctsu_dtc_info.block_size         = 1;
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    g_ctsu_dtc_info.dest_addr_mode     = DTC_DES_ADDR_INCR;
    g_ctsu_dtc_info.data_size          = DTC_DATA_SIZE_WORD;
    g_ctsu_dtc_info.transfer_mode      = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_info.repeat_block_side  = DTC_REPEAT_BLOCK_SOURCE;
    g_ctsu_dtc_info.block_size         = 2;
  #endif
    g_ctsu_dtc_info.transfer_count     = 1;
  #if (BSP_FEATURE_CTSU_VERSION == 2)
    g_ctsu_dtc_info.source_addr        = (uint32_t) &(CTSU.CTSUSCNT.LONG);
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    g_ctsu_dtc_info.source_addr        = (uint32_t) &(CTSU.CTSUSC.WORD);
  #endif
    g_ctsu_dtc_info.dest_addr          = (uint32_t)p_instance_ctrl->p_self_raw;

  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
    {
        g_ctsu_dtc_info.dest_addr      = (uint32_t)p_instance_ctrl->p_mutual_raw;
    }
  #endif
    g_transfer_info_rx = g_ctsu_dtc_info;

    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;


    dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, &g_transfer_data_rx, &g_ctsu_dtc_info, 0);
     if(dtc_err != DTC_SUCCESS)
     {
         return FSP_ERR_ASSERTION;
     }

     IEN(CTSU,CTSUWR) = ien_bk;
    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);
    R_DTC_Control(DTC_CMD_DTC_START, NULL, NULL);

    return FSP_SUCCESS;
}
 #else
/***********************************************************************************************************************
 * ctsu_transfer_auto_open
 ***********************************************************************************************************************/
fsp_err_t ctsu_transfer_auto_open (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    dtc_err_t dtc_err;
    uint8_t   ien_bk;
    uint32_t  calc_transfer_count;

    calc_transfer_count = p_instance_ctrl->num_elements * CTSU_CFG_NUM_SUMULTI;
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        calc_transfer_count = 1;
    }

    /* DTC Open */
    R_DTC_Open();

    dtc_err = R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);

    /* CTSUWR setting */
    g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSUWR;

    dtc_err = R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

    ctsu_transfer_auto_ctsuso_set (0, DTC_CHAIN_TRANSFER_DISABLE, DTC_CHAIN_TRANSFER_CONTINUOUSLY, calc_transfer_count);
    ctsu_transfer_auto_address_set (0, (uint32_t *)p_instance_ctrl->p_ctsuwr, (uint32_t *)&(CTSU.CTSUSO.LONG));

    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;

    dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_tx, g_ctsu_dtc_auto_info, 0);
    if(dtc_err != DTC_SUCCESS)
    {
        return FSP_ERR_ASSERTION;
    }

    IEN(CTSU,CTSUWR) = ien_bk;
    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    /* CTSURD setting */
    g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSURD;

    R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

    ctsu_transfer_auto_ctsuscnt_set (0, DTC_CHAIN_TRANSFER_DISABLE, DTC_CHAIN_TRANSFER_CONTINUOUSLY, calc_transfer_count);
    ctsu_transfer_auto_address_set (0, (uint32_t *)&(CTSU.CTSUSCNT.LONG), (uint32_t *)p_instance_ctrl->p_self_raw);

  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
    {
        g_ctsu_dtc_auto_info[0].dest_addr      = (uint32_t)p_instance_ctrl->p_mutual_raw;
    }
  #endif

    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;

    dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_rx, g_ctsu_dtc_auto_info, 0);
    if(dtc_err != DTC_SUCCESS)
    {
        return FSP_ERR_ASSERTION;
    }

    IEN(CTSU,CTSUWR) = ien_bk;
    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);
    R_DTC_Control(DTC_CMD_DTC_START, NULL, NULL);

    return FSP_SUCCESS;
}
 #endif

/***********************************************************************************************************************
 * ctsu_transfer_close
 ***********************************************************************************************************************/
fsp_err_t ctsu_transfer_close (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    R_DTC_Close();

    return FSP_SUCCESS;
}

 #if (CTSU_CFG_AUTO_JUDGE_ENABLE == 0)
/***********************************************************************************************************************
 * ctsu_transfer_configure
 ***********************************************************************************************************************/
fsp_err_t ctsu_transfer_configure (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    dtc_err_t dtc_err;
    uint8_t                 ien_bk;

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);

    /* CTSUWR setting */

    g_ctsu_dtc_info = g_transfer_info_tx;
    g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSUWR;

    R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

  #if (BSP_FEATURE_CTSU_VERSION == 2)
    g_ctsu_dtc_info.block_size = 1;
    if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
    {
        g_ctsu_dtc_info.transfer_count   = 1;
        g_ctsu_dtc_info.source_addr      = (uint32_t)&(g_ctsu_correction_info.ctsuwr);
    }

   #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        if (CTSU_DIAG_CLOCK_RECOVERY == g_ctsu_diag_info.state)
        {
            g_ctsu_dtc_info.src_addr_mode      = DTC_SRC_ADDR_FIXED;
            g_ctsu_dtc_info.transfer_count     = 3;
        }
        else
        {
            g_ctsu_dtc_info.src_addr_mode      = DTC_SRC_ADDR_INCR;
            g_ctsu_dtc_info.transfer_count     = 1;
        }

