xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
        g_ctsu_dtc_info.source_addr            = (uint32_t)&(g_ctsu_diag_info.ctsuwr);
    }
   #endif
    else
    {
        g_ctsu_dtc_info.src_addr_mode = DTC_SRC_ADDR_INCR;

        if (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->md)
        {
            g_ctsu_dtc_info.transfer_count     = p_instance_ctrl->num_elements;
        }
        else
        {
            g_ctsu_dtc_info.transfer_count     = (uint16_t) (p_instance_ctrl->num_elements * CTSU_CFG_NUM_SUMULTI);
        }
        g_ctsu_dtc_info.source_addr            = (uint32_t)p_instance_ctrl->p_ctsuwr;
    }
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    g_ctsu_dtc_info.block_size = 3;
    if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
    {
        g_ctsu_dtc_info.transfer_count   = 1;
        g_ctsu_dtc_info.source_addr      = (uint32_t)&(g_ctsu_correction_info.ctsuwr);
    }

   #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        g_ctsu_dtc_info.transfer_count   = 1;
        g_ctsu_dtc_info.source_addr      = (uint32_t)&(g_ctsu_diag_info.ctsuwr);
    }
   #endif
    else if ((CTSU_CORRECTION_RUN != g_ctsu_correction_info.status) &&
             (CTSU_MODE_DIAGNOSIS_SCAN != p_instance_ctrl->md))
    {
        g_ctsu_dtc_info.transfer_count   = p_instance_ctrl->num_elements;
        g_ctsu_dtc_info.source_addr      =(uint32_t)p_instance_ctrl->p_ctsuwr;
  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
       if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
       {
           if (true == p_instance_ctrl->serial_tuning_enable)
           {
               if (0 == ((p_instance_ctrl->ctsucr1 >> 7) & 0x01))
               {
                   g_ctsu_dtc_info.transfer_count    = (uint16_t) (p_instance_ctrl->num_elements * 2);
               }
           }
       }
  #endif
    }
    else
    {
    }
  #endif

    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;

     dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, &g_transfer_data_tx, &g_ctsu_dtc_info, 0);
     if(dtc_err != DTC_SUCCESS)
     {
         return FSP_ERR_ASSERTION;
     }

     IEN(CTSU,CTSUWR) = ien_bk;

     R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    /* CTSURD setting */

     g_ctsu_dtc_info = g_transfer_info_rx;
     g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSURD;

     R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

  #if (BSP_FEATURE_CTSU_VERSION == 2)
    g_ctsu_dtc_info.block_size = 1;
    if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
    {
        g_ctsu_dtc_info.data_size        = DTC_DATA_SIZE_WORD;
        g_ctsu_dtc_info.transfer_count   = 1;
        g_ctsu_dtc_info.dest_addr        = (uint32_t)&g_ctsu_correction_info.scanbuf;
        g_ctsu_dtc_info.source_addr      = (uint32_t)&(CTSU.CTSUSCNT.LONG);
    }

   #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        g_ctsu_dtc_info.data_size        = DTC_DATA_SIZE_LWORD;
        g_ctsu_dtc_info.block_size       = 1;
        if (CTSU_DIAG_CLOCK_RECOVERY == g_ctsu_diag_info.state)
        {
            g_ctsu_dtc_info.dest_addr_mode    = DTC_DES_ADDR_INCR;
            g_ctsu_dtc_info.transfer_count    = 3;
        }
        else
        {
            g_ctsu_dtc_info.transfer_count    = 1;
        }

        g_ctsu_dtc_info.dest_addr        = (uint32_t)&(g_ctsu_diag_info.ctsuscnt[0]);
        g_ctsu_dtc_info.source_addr      = (uint32_t)&(CTSU.CTSUSCNT.LONG);
    }
   #endif
    else
    {
        g_ctsu_dtc_info.data_size  = DTC_DATA_SIZE_WORD;
        g_ctsu_dtc_info.block_size = 1;
        g_ctsu_dtc_info.dest_addr_mode    = DTC_DES_ADDR_INCR;

        if (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->md)
        {
            g_ctsu_dtc_info.transfer_count    = p_instance_ctrl->num_elements;
        }
        else
        {
            g_ctsu_dtc_info.transfer_count    = (uint16_t) (p_instance_ctrl->num_elements * CTSU_CFG_NUM_SUMULTI);
        }

        g_ctsu_dtc_info.dest_addr        = (uint32_t)p_instance_ctrl->p_self_raw;
   #if (BSP_FEATURE_CTSU_VERSION == 2)
        g_ctsu_dtc_info.source_addr      = (uint32_t) &(CTSU.CTSUSCNT.LONG);
   #endif
   #if (BSP_FEATURE_CTSU_VERSION == 1)
        g_ctsu_dtc_info.source_addr      = (uint32_t) &(CTSU.CTSUSC.WORD);
   #endif
   #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
        {
            g_ctsu_dtc_info.dest_addr        = (uint32_t)p_instance_ctrl->p_mutual_raw;
            g_ctsu_dtc_info.transfer_count   = (uint16_t) (g_ctsu_dtc_info.transfer_count * 2);
        }

   #endif
    }
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    g_ctsu_dtc_info.block_size = 2;
    if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
    {
        g_ctsu_dtc_info.transfer_count = 1;
        g_ctsu_dtc_info.dest_addr      = (uint32_t)&g_ctsu_correction_info.scanbuf;
    }

   #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        g_ctsu_dtc_info.transfer_count    = 1;
        g_ctsu_dtc_info.dest_addr        = (uint32_t)&g_ctsu_diag_info.scanbuf;
    }
   #endif
    else if ((CTSU_CORRECTION_RUN != g_ctsu_correction_info.status) &&
             (CTSU_MODE_DIAGNOSIS_SCAN != p_instance_ctrl->md))
    {
        g_ctsu_dtc_info.transfer_count = p_instance_ctrl->num_elements;
        g_ctsu_dtc_info.dest_addr      = (uint32_t)p_instance_ctrl->p_self_raw;
   #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
        {
            g_ctsu_dtc_info.dest_addr        = (uint32_t)p_instance_ctrl->p_mutual_raw;
            g_ctsu_dtc_info.transfer_count    = (uint16_t) (g_ctsu_dtc_info.transfer_count * 2);

            if (true == p_instance_ctrl->serial_tuning_enable)
            {
                if (0 == ((p_instance_ctrl->ctsucr1 >> 7) & 0x01))
                {
                    g_ctsu_dtc_info.transfer_count    = (uint16_t) (p_instance_ctrl->num_elements * 2);
                }
            }
        }
   #endif
    }
    else
    {
    }
  #endif

    ien_bk = IEN(CTSU,CTSUWR);
    IEN(CTSU,CTSUWR) = 0U;

    dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, &g_transfer_data_rx, &g_ctsu_dtc_info, 0);
    if(dtc_err != DTC_SUCCESS)
    {
        return FSP_ERR_ASSERTION;
    }

    IEN(CTSU,CTSUWR) = ien_bk;

    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);
    R_DTC_Control(DTC_CMD_DTC_START, NULL, NULL);

