xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    return FSP_SUCCESS;
}
 #else
/***********************************************************************************************************************
 * ctsu_transfer_auto_configure
 ***********************************************************************************************************************/
fsp_err_t ctsu_transfer_auto_configure (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    dtc_err_t dtc_err;
    uint8_t   ien_bk;
    uint32_t  calc_transfer_count;

    calc_transfer_count = p_instance_ctrl->num_elements * CTSU_CFG_NUM_SUMULTI;

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);

    /* CTSUWR setting */
    /* After the initial offset tuning is completed, set the DTC for automatic judgement.                             */
    /* In addition, the method for which automatic judgement is disabled does not set the DTC for automatic judgement. */
    if((CTSU_TUNING_INCOMPLETE == p_instance_ctrl->tuning) || (0 == p_instance_ctrl->p_ctsu_cfg->ajfen))
    {
        g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSUWR;

        R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

        ctsu_transfer_auto_ctsuso_set (0, DTC_CHAIN_TRANSFER_DISABLE, DTC_CHAIN_TRANSFER_CONTINUOUSLY, calc_transfer_count);
        ctsu_transfer_auto_address_set (0, (uint32_t *)p_instance_ctrl->p_ctsuwr, (uint32_t *)&(CTSU.CTSUSO.LONG));

        if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
        {
            g_ctsu_dtc_auto_info[0].transfer_count   = 1;
            g_ctsu_dtc_auto_info[0].source_addr      = (uint32_t)&(g_ctsu_correction_info.ctsuwr);
        }

  #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
        else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
        {
            if (CTSU_DIAG_CLOCK_RECOVERY == g_ctsu_diag_info.state)
            {
                g_ctsu_dtc_auto_info[0].src_addr_mode      = DTC_SRC_ADDR_FIXED;
                g_ctsu_dtc_auto_info[0].transfer_count     = 3;
            }
            else
            {
                g_ctsu_dtc_auto_info[0].src_addr_mode      = DTC_SRC_ADDR_INCR;
                g_ctsu_dtc_auto_info[0].transfer_count     = 1;
            }

            g_ctsu_dtc_auto_info[0].source_addr            = (uint32_t)&(g_ctsu_diag_info.ctsuwr);
        }
  #endif
        else
        {
            if (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->md)
            {
                g_ctsu_dtc_auto_info[0].transfer_count     = p_instance_ctrl->num_elements;
            }
        }

        ien_bk = IEN(CTSU,CTSUWR);
        IEN(CTSU,CTSUWR) = 0U;

        dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_tx, g_ctsu_dtc_auto_info, 0);
        if(dtc_err != DTC_SUCCESS)
        {
            return FSP_ERR_ASSERTION;
        }
    }
    else    /* DTC setting for automatic judgement */
    {
        g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSUWR;

        R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

        /* For automatic judgement register transfer */
        ctsu_transfer_auto_judge_set (0, DTC_REPEAT_BLOCK_DESTINATION, calc_transfer_count);
        ctsu_transfer_auto_address_set (0, (uint32_t *)p_instance_ctrl->p_auto_judge, (uint32_t *)&(CTSU.CTSUAJTHR.LONG));

        /* For CTSUSO register transfer */
        ctsu_transfer_auto_ctsuso_set (1, DTC_CHAIN_TRANSFER_ENABLE, DTC_CHAIN_TRANSFER_NORMAL, calc_transfer_count);
        ctsu_transfer_auto_address_set (1, (uint32_t *)p_instance_ctrl->p_ctsuwr, (uint32_t *)&(CTSU.CTSUSO.LONG));

       /* For transfer of the start address of variables for automatic judgement */
       ctsu_transfer_auto_repeat_set (2, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_DESTINATION);
       ctsu_transfer_auto_address_set (2, (uint32_t *)&p_instance_ctrl->adress_auto_judge, (uint32_t *)&g_transfer_data_auto_tx[0].lw2);

       /* Number of transfers in the automatic judgement register For forwarding */
       ctsu_transfer_auto_repeat_set (3, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_DESTINATION);
       ctsu_transfer_auto_address_set (3, (uint32_t *)&p_instance_ctrl->count_auto_judge, (uint32_t *)&g_transfer_data_auto_tx[0].lw4);

       /* For transfer of the start address of variables for CTSUSO */
       ctsu_transfer_auto_repeat_set (4, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_DESTINATION);
       ctsu_transfer_auto_address_set (4, (uint32_t *)&p_instance_ctrl->adress_ctsuwr, (uint32_t *)&g_transfer_data_auto_tx[1].lw2);

       /* Number of transfers of CTSUSO register For forwarding */
       ctsu_transfer_auto_repeat_set (5, DTC_CHAIN_TRANSFER_DISABLE, DTC_REPEAT_BLOCK_DESTINATION);
       ctsu_transfer_auto_address_set (5, (uint32_t *)&p_instance_ctrl->count_ctsuwr_self_mutual, (uint32_t *)&g_transfer_data_auto_tx[1].lw4);

       ien_bk = IEN(CTSU,CTSUWR);
       IEN(CTSU,CTSUWR) = 0U;

       dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_tx, g_ctsu_dtc_auto_info, 5);
       if(dtc_err != DTC_SUCCESS)
       {
           return FSP_ERR_ASSERTION;
       }
    }

     IEN(CTSU,CTSUWR) = ien_bk;

     R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    /* CTSURD setting */
     if((CTSU_TUNING_INCOMPLETE == p_instance_ctrl->tuning) || (0 == p_instance_ctrl->p_ctsu_cfg->ajfen))
     {
         g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSURD;

         R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

         ctsu_transfer_auto_ctsuscnt_set (0, DTC_CHAIN_TRANSFER_DISABLE, DTC_CHAIN_TRANSFER_CONTINUOUSLY, calc_transfer_count);
         ctsu_transfer_auto_address_set (0, (uint32_t *)&(CTSU.CTSUSCNT.LONG), (uint32_t *)p_instance_ctrl->p_self_raw);

        if (CTSU_CORRECTION_RUN == g_ctsu_correction_info.status)
        {
            g_ctsu_dtc_auto_info[0].transfer_count   = 1;
            g_ctsu_dtc_auto_info[0].dest_addr        = (uint32_t)&g_ctsu_correction_info.scanbuf;
            g_ctsu_dtc_auto_info[0].source_addr      = (uint32_t)&(CTSU.CTSUSCNT.LONG);
        }

  #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
        else if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
        {
            g_ctsu_dtc_auto_info[0].data_size        = DTC_DATA_SIZE_LWORD;
            g_ctsu_dtc_auto_info[0].block_size       = 1;
            if (CTSU_DIAG_CLOCK_RECOVERY == g_ctsu_diag_info.state)
            {
                g_ctsu_dtc_auto_info[0].dest_addr_mode    = DTC_DES_ADDR_INCR;
                g_ctsu_dtc_auto_info[0].transfer_count    = 3;
            }
            else
            {
                g_ctsu_dtc_auto_info[0].transfer_count    = 1;
            }

