xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
            g_ctsu_dtc_auto_info[0].dest_addr        = (uint32_t)&(g_ctsu_diag_info.ctsuscnt[0]);
            g_ctsu_dtc_auto_info[0].source_addr      = (uint32_t)&(CTSU.CTSUSCNT.LONG);
        }
  #endif
        else
        {
            if (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->md)
            {
                g_ctsu_dtc_auto_info[0].transfer_count    = p_instance_ctrl->num_elements;
            }

  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
            if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
            {
                g_ctsu_dtc_auto_info[0].dest_addr        = (uint32_t)p_instance_ctrl->p_mutual_raw;
                g_ctsu_dtc_auto_info[0].transfer_count   = (uint16_t) (g_ctsu_dtc_auto_info[0].transfer_count * 2);
            }

  #endif
        }

        ien_bk = IEN(CTSU,CTSUWR);
        IEN(CTSU,CTSUWR) = 0U;

        dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_rx, g_ctsu_dtc_auto_info, 0);
        if(dtc_err != DTC_SUCCESS)
        {
            return FSP_ERR_ASSERTION;
        }
     }
     else    /* DTC setting for automatic judgement */
     {
         g_ctsu_dtc_cmd_arg.act_src = (dtc_activation_source_t)IR_CTSU_CTSURD;

         R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_ctsu_dtc_cmd_arg);

         /* For automatic judgement register transfer */
         ctsu_transfer_auto_judge_set (0, DTC_REPEAT_BLOCK_SOURCE, calc_transfer_count);
         ctsu_transfer_auto_address_set (0, (uint32_t *)&(CTSU.CTSUAJTHR.LONG), (uint32_t *)p_instance_ctrl->p_auto_judge);

         /* For CTSUSCNT register transfer */
         ctsu_transfer_auto_ctsuscnt_set (1, DTC_CHAIN_TRANSFER_ENABLE, DTC_CHAIN_TRANSFER_NORMAL, calc_transfer_count);
         ctsu_transfer_auto_address_set (1, (uint32_t *)&(CTSU.CTSUSCNT.LONG), (uint32_t *)p_instance_ctrl->p_self_raw);
  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
         if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
         {
             g_ctsu_dtc_auto_info[1].dest_addr        = (uint32_t)p_instance_ctrl->p_mutual_raw;
         }
  #endif

        /* For transfer of the start address of variables for automatic judgement */
        ctsu_transfer_auto_repeat_set (2, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_SOURCE);
        ctsu_transfer_auto_address_set (2, (uint32_t *)&p_instance_ctrl->adress_auto_judge, (uint32_t *)&g_transfer_data_auto_rx[0].lw3);

        /* Number of transfers in the automatic judgement register For forwarding */
        ctsu_transfer_auto_repeat_set (3, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_SOURCE);
        ctsu_transfer_auto_address_set (3, (uint32_t *)&p_instance_ctrl->count_auto_judge, (uint32_t *)&g_transfer_data_auto_rx[0].lw4);

        /* For transfer of the start address of variables for CTSUSCNT */
        ctsu_transfer_auto_repeat_set (4, DTC_CHAIN_TRANSFER_ENABLE, DTC_REPEAT_BLOCK_SOURCE);
        ctsu_transfer_auto_address_set (4, (uint32_t *)&p_instance_ctrl->adress_self_raw, (uint32_t *)&g_transfer_data_auto_rx[1].lw3);
  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->md))
        {
            g_ctsu_dtc_auto_info[4].source_addr        = (uint32_t)&p_instance_ctrl->adress_mutual_raw;
        }
  #endif

        /* Number of transfers of CTSUSCNT register For forwarding */
        ctsu_transfer_auto_repeat_set (5, DTC_CHAIN_TRANSFER_DISABLE, DTC_REPEAT_BLOCK_SOURCE);
        ctsu_transfer_auto_address_set (5, (uint32_t *)&p_instance_ctrl->count_ctsuwr_self_mutual, (uint32_t *)&g_transfer_data_auto_rx[1].lw4);

        ien_bk = IEN(CTSU,CTSUWR);
        IEN(CTSU,CTSUWR) = 0U;

        dtc_err = R_DTC_Create(g_ctsu_dtc_cmd_arg.act_src, g_transfer_data_auto_rx, g_ctsu_dtc_auto_info, 5);
        if(dtc_err != DTC_SUCCESS)
        {
            return FSP_ERR_ASSERTION;
        }
     }

    IEN(CTSU,CTSUWR) = ien_bk;

    R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_ctsu_dtc_cmd_arg);

    R_DTC_Control(DTC_CMD_DTC_STOP, NULL, NULL);
    R_DTC_Control(DTC_CMD_DTC_START, NULL, NULL);

    return FSP_SUCCESS;
}

/***********************************************************************************************************************
 * ctsu_transfer_auto_judge_set
 ***********************************************************************************************************************/
void ctsu_transfer_auto_judge_set (uint8_t array_number, dtc_repeat_block_side_t set_repeat_block_side, uint32_t set_transfer_count)
{
    g_ctsu_dtc_auto_info[array_number].chain_transfer_enable = DTC_CHAIN_TRANSFER_ENABLE;
    g_ctsu_dtc_auto_info[array_number].chain_transfer_mode   = DTC_CHAIN_TRANSFER_CONTINUOUSLY;
    g_ctsu_dtc_auto_info[array_number].src_addr_mode         = DTC_SRC_ADDR_INCR;
    g_ctsu_dtc_auto_info[array_number].dest_addr_mode        = DTC_DES_ADDR_INCR;
    g_ctsu_dtc_auto_info[array_number].response_interrupt    = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
    g_ctsu_dtc_auto_info[array_number].transfer_mode         = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_auto_info[array_number].repeat_block_side     = set_repeat_block_side;
    g_ctsu_dtc_auto_info[array_number].data_size             = DTC_DATA_SIZE_LWORD;
    g_ctsu_dtc_auto_info[array_number].block_size            = 5;
    g_ctsu_dtc_auto_info[array_number].transfer_count        = set_transfer_count;
}

/***********************************************************************************************************************
 * ctsu_transfer_auto_ctsuso_set
 ***********************************************************************************************************************/
void ctsu_transfer_auto_ctsuso_set (uint8_t array_number, dtc_chain_transfer_t set_chain_transfer_enable, dtc_chain_transfer_mode_t set_chain_transfer_mode, uint32_t set_transfer_count)
{
    g_ctsu_dtc_auto_info[array_number].chain_transfer_enable = set_chain_transfer_enable;
    g_ctsu_dtc_auto_info[array_number].chain_transfer_mode   = set_chain_transfer_mode;
    g_ctsu_dtc_auto_info[array_number].src_addr_mode         = DTC_SRC_ADDR_INCR;
    g_ctsu_dtc_auto_info[array_number].dest_addr_mode        = DTC_DES_ADDR_FIXED;
    g_ctsu_dtc_auto_info[array_number].response_interrupt    = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
    g_ctsu_dtc_auto_info[array_number].transfer_mode         = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_auto_info[array_number].repeat_block_side     = DTC_REPEAT_BLOCK_DESTINATION;
    g_ctsu_dtc_auto_info[array_number].data_size             = DTC_DATA_SIZE_LWORD;
    g_ctsu_dtc_auto_info[array_number].block_size            = 1;
    g_ctsu_dtc_auto_info[array_number].transfer_count        = set_transfer_count;
}

