xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
/***********************************************************************************************************************
 * ctsu_transfer_auto_ctsuscnt_set
 ***********************************************************************************************************************/
void ctsu_transfer_auto_ctsuscnt_set (uint8_t array_number, dtc_chain_transfer_t set_chain_transfer_enable, dtc_chain_transfer_mode_t set_chain_transfer_mode, uint32_t set_transfer_count)
{
    g_ctsu_dtc_auto_info[array_number].chain_transfer_enable = set_chain_transfer_enable;
    g_ctsu_dtc_auto_info[array_number].chain_transfer_mode   = set_chain_transfer_mode;
    g_ctsu_dtc_auto_info[array_number].src_addr_mode         = DTC_SRC_ADDR_FIXED;
    g_ctsu_dtc_auto_info[array_number].dest_addr_mode        = DTC_DES_ADDR_INCR;
    g_ctsu_dtc_auto_info[array_number].response_interrupt    = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
    g_ctsu_dtc_auto_info[array_number].transfer_mode         = DTC_TRANSFER_MODE_BLOCK;
    g_ctsu_dtc_auto_info[array_number].repeat_block_side     = DTC_REPEAT_BLOCK_SOURCE;
    g_ctsu_dtc_auto_info[array_number].data_size             = DTC_DATA_SIZE_WORD;
    g_ctsu_dtc_auto_info[array_number].block_size            = 1;
    g_ctsu_dtc_auto_info[array_number].transfer_count        = set_transfer_count;
}

/***********************************************************************************************************************
 * ctsu_transfer_auto_repeat_set
 ***********************************************************************************************************************/
void ctsu_transfer_auto_repeat_set (uint8_t array_number, dtc_chain_transfer_t set_chain_transfer_enable, dtc_repeat_block_side_t set_repeat_block_side)
{
    g_ctsu_dtc_auto_info[array_number].chain_transfer_enable = set_chain_transfer_enable;
    g_ctsu_dtc_auto_info[array_number].chain_transfer_mode   = DTC_CHAIN_TRANSFER_CONTINUOUSLY;
    g_ctsu_dtc_auto_info[array_number].src_addr_mode         = DTC_SRC_ADDR_FIXED;
    g_ctsu_dtc_auto_info[array_number].dest_addr_mode        = DTC_DES_ADDR_FIXED;
    g_ctsu_dtc_auto_info[array_number].response_interrupt    = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
    g_ctsu_dtc_auto_info[array_number].transfer_mode         = DTC_TRANSFER_MODE_REPEAT;
    g_ctsu_dtc_auto_info[array_number].repeat_block_side     = set_repeat_block_side;
    g_ctsu_dtc_auto_info[array_number].data_size             = DTC_DATA_SIZE_LWORD;
    g_ctsu_dtc_auto_info[array_number].block_size            = 1;
    g_ctsu_dtc_auto_info[array_number].transfer_count        = 1;
}

/***********************************************************************************************************************
 * ctsu_transfer_auto_address_set
 ***********************************************************************************************************************/
void ctsu_transfer_auto_address_set (uint8_t array_number, uint32_t * p_set_source_addr, uint32_t * p_set_dest_addr)
{
    g_ctsu_dtc_auto_info[array_number].source_addr = (uint32_t)p_set_source_addr;
    g_ctsu_dtc_auto_info[array_number].dest_addr   = (uint32_t)p_set_dest_addr;
}
 #endif
#endif

/***********************************************************************************************************************
 * ctsu_initial_offset_tuning
 ***********************************************************************************************************************/
void ctsu_initial_offset_tuning (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    uint16_t element_id;
    int32_t  diff          = 0;
    uint32_t complete_flag = 0;
    uint32_t num_complete  = 0;
    uint16_t target_val;
#if (BSP_FEATURE_CTSU_VERSION == 1)
    uint16_t               ctsuso;
    ctsu_correction_calc_t calc;
#endif
#if (BSP_FEATURE_CTSU_VERSION == 2)
    uint16_t i;
    uint16_t element_top;
    uint16_t corr_data[CTSU_CFG_NUM_SUMULTI];
    int32_t  ctsuso;
    uint32_t snum;
    int32_t  offset_unit;
#endif

    /* element_id through each element for control block */
    for (element_id = 0; element_id < p_instance_ctrl->num_elements; element_id++)
    {
        if (0 == *(p_instance_ctrl->p_element_complete_flag + element_id))
        {
#if (BSP_FEATURE_CTSU_VERSION == 1)
            if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->md)
            {
                target_val = (p_instance_ctrl->tuning_self_target_value);
            }
            else
            {
                target_val = (p_instance_ctrl->tuning_mutual_target_value);
            }

            calc.snum  = (p_instance_ctrl->p_ctsuwr[element_id].ctsuso0 >> 10) & CTSU_SNUM_MAX;
            calc.sdpa  = (p_instance_ctrl->p_ctsuwr[element_id].ctsuso1 >> 8) & CTSU_SDPA_MAX;
            target_val = (uint16_t) (target_val *
                                     (uint32_t) ((calc.snum + 1) * (calc.sdpa + 1)) /
                                     g_ctsu_correction_info.ctsu_clock);
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
            if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->md)
            {
                diff = (p_instance_ctrl->p_self_data + element_id)->int_data - target_val;
            }
 #endif
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
            if (CTSU_MODE_MUTUAL_FULL_SCAN == p_instance_ctrl->md)
            {
                diff = (p_instance_ctrl->p_mutual_pri_data + element_id)->int_data - target_val;
            }
 #endif
            ctsuso = (p_instance_ctrl->p_ctsuwr[element_id].ctsuso0 & CTSU_TUNING_MAX);
            if (0 < diff)
            {
                if (*(p_instance_ctrl->p_tuning_diff + element_id) < 0)
                {
                    if ((-diff) > *(p_instance_ctrl->p_tuning_diff + element_id))
                    {
                        ctsuso++;      ///< Decrease count
                    }

                    complete_flag = 1;
                }
                else
                {
                    if (CTSU_TUNING_MAX == ctsuso) /* CTSUSO limit check    */
                    {
                        complete_flag = 1;
                    }
                    else
                    {
                        ctsuso++;                                                ///< Decrease count
                        (*(p_instance_ctrl->p_tuning_diff + element_id)) = diff; ///< Plus
                    }
                }
            }
            else if (0 == diff)
            {
                complete_flag = 1;
            }
            else
            {
                if (*(p_instance_ctrl->p_tuning_diff + element_id) > 0)
                {
                    if ((-diff) > *(p_instance_ctrl->p_tuning_diff + element_id))
                    {
                        ctsuso--;      ///< Increase count
                    }

