xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
#if (BSP_FEATURE_CTSU_VERSION == 1)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == p_instance_ctrl->md)
    {
        if (true == p_instance_ctrl->serial_tuning_enable)
        {
            if (0 == ((p_instance_ctrl->ctsucr1 >> 7) & 0x01))
            {
                rd_index = (uint16_t) (p_instance_ctrl->serial_tuning_mutual_cnt);
            }
        }
    }
#endif

#if (BSP_FEATURE_CTSU_VERSION == 2)
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == p_instance_ctrl->md)
    {
        if (true == p_instance_ctrl->serial_tuning_enable)
        {
            if (0 == ((p_instance_ctrl->ctsucr1 >> 7) & 0x01))
            {
                rd_index = p_instance_ctrl->rd_index;
            }
            else
            {
                rd_index = p_instance_ctrl->rd_index / 2;
            }
        }
        else
        {
            /* In the mutual capacity of CTSU2, the value of rd_index is twice the value of wr_index. */
            rd_index = p_instance_ctrl->rd_index / 2;
        }
    }

  #if (CTSU_CFG_NUM_CFC != 0)
    if (CTSU_MODE_MUTUAL_CFC_SCAN == p_instance_ctrl->md)
    {
        if (true == p_instance_ctrl->serial_tuning_enable)
        {
            if (0 == ((p_instance_ctrl->ctsucr1 >> 7) & 0x01))
            {
                rd_index = p_instance_ctrl->rd_index;
            }
            else
            {
                rd_index = (uint16_t) (p_instance_ctrl->rd_index / (p_instance_ctrl->p_ctsu_cfg->num_rx * 2));
            }
        }
        else
        {
            /* In the CFC mutual capacity of CTSU2, rd_index is twice the number of RX terminals in each wr_index. */
            rd_index = (uint16_t) (p_instance_ctrl->rd_index / (p_instance_ctrl->p_ctsu_cfg->num_rx * 2));
        }
    }
  #endif
 #endif
#endif

    /* Countermeasure for the problem that RD interrupt and FN interrupt are reversed. */
    if (rd_index != p_instance_ctrl->wr_index)
    {
        p_instance_ctrl->interrupt_reverse_flag = 1;

        return;
    }

    ctsu_end_interrupt(p_instance_ctrl);
}

void ctsu_end_interrupt (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_callback_args_t args;

    /* Store callback arguments in memory provided by user if available.  This allows callback arguments to be
     * stored in non-secure memory so they can be accessed by a non-secure callback function. */
    ctsu_callback_args_t * p_args = p_instance_ctrl->p_callback_memory;
    if (NULL == p_args)
    {
        /* Store on stack */
        p_args = &args;
    }
    else
    {
        /* Save current arguments on the stack in case this is a nested interrupt. */
        args = *p_args;
    }

#if (BSP_FEATURE_CTSU_VERSION == 1)
 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_DIAG_OVER_VOLTAGE == g_ctsu_diag_info.state)
    {
        if (CTSU.CTSUERRS.BIT.CTSUICOMP == 1)
        {
            g_ctsu_diag_info.icomp = 1;
        }
    }
 #endif
#endif

#if (BSP_FEATURE_CTSU_VERSION == 2)
 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
    if (CTSU_MODE_DIAGNOSIS_SCAN == p_instance_ctrl->md)
    {
        if (CTSU_DIAG_OVER_CURRENT == g_ctsu_diag_info.state)
        {
            if (CTSU.CTSUSR.BIT.ICOMP1 == 1)
            {
                g_ctsu_diag_info.icomp1_value = CTSU.CTSUSR.BIT.ICOMP1;
            }
        }
    }
 #endif
#endif

    p_args->event = CTSU_EVENT_SCAN_COMPLETE;

#if (BSP_FEATURE_CTSU_VERSION == 2)
    if (CTSU.CTSUSR.BIT.SCOVF)
    {
        p_args->event  |= CTSU_EVENT_OVERFLOW;
        CTSU.CTSUSR.BIT.SCOVF = 0;
    }

    if ((1 == CTSU.CTSUSR.BIT.ICOMP0) || (1 == CTSU.CTSUSR.BIT.ICOMP1))
    {
        if (CTSU.CTSUSR.BIT.ICOMP0)
        {
            p_args->event |= CTSU_EVENT_ICOMP;
        }
        if (CTSU.CTSUSR.BIT.ICOMP1)
        {
            p_args->event |= CTSU_EVENT_ICOMP1;
        }

        CTSU.CTSUSR.BIT.ICOMPRST = 1;
    }
#endif
#if (BSP_FEATURE_CTSU_VERSION == 1)

    if (CTSU.CTSUST.BIT.CTSUSOVF)
    {
        p_args->event  |= CTSU_EVENT_OVERFLOW;
        CTSU.CTSUST.BIT.CTSUSOVF = 0;
    }

    if (CTSU.CTSUERRS.BIT.CTSUICOMP == 1)
    {
        CTSU.CTSUCR1.BYTE &= (uint8_t) (~0x01);
        R_BSP_NOP();
        R_BSP_NOP();
        CTSU.CTSUCR1.BYTE |= 0x01;
        p_args->event   |= CTSU_EVENT_ICOMP;
    }
#endif
#if (BSP_FEATURE_CTSU_VERSION == 2)
 #if (CTSU_CFG_TEMP_CORRECTION_SUPPORT == 1)
    if (CTSU_CORRECTION_RUN != g_ctsu_correction_info.status)
    {
        if (CTSU_MODE_CORRECTION_SCAN == p_instance_ctrl->md)
        {
            CTSU.CTSUCRA.BIT.SDPSEL      = 0;
            CTSU.CTSUSUCLKA.BIT.SUADJ0   = g_ctsu_correction_info.suadj0;
            CTSU.CTSUSUCLKA.BIT.SUMULTI0 = CTSU_CFG_SUMULTI0;
            CTSU.CTSUCRB.BIT.SSCNT       = 1;
            CTSU.CTSUCALIB.BIT.SUCARRY   = 0;
            CTSU.CTSUCALIB.BIT.CCOCALIB  = 0;
            CTSU.CTSUCALIB.BIT.CCOCLK    = 1;
            CTSU.CTSUCALIB.BIT.TSOC      = 0;
            CTSU.CTSUCRA.BIT.SDPSEL      = 1;
        }
    }
 #endif
#endif

#if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
    if ((1 == p_instance_ctrl->tsod) && (CTSU_CAP_EXTERNAL == p_instance_ctrl->cap))
    {
        /* When using MEC, MD0 bit is set to single scan mode. */
        CTSU.CTSUMCH.BIT.MCH0 = p_instance_ctrl->mec_ts;

        /* Set MCH1 when using both MEC and Active Shield.*/
        if((0 != p_instance_ctrl->ctsuchtrc0)
                || (0 != p_instance_ctrl->ctsuchtrc1)
                || (0 != p_instance_ctrl->ctsuchtrc2)
                || (0 != p_instance_ctrl->ctsuchtrc3)
                || (0 != p_instance_ctrl->ctsuchtrc4))
        {
            CTSU.CTSUMCH.BIT.MCH1 = p_instance_ctrl->mec_shield_ts;
        }
    }
#endif

    p_instance_ctrl->state        = CTSU_STATE_SCANNED;
    p_instance_ctrl->error_status = args.event;
    p_args->p_context             = p_instance_ctrl->p_context;

    /* If a callback was provided, call it with the argument */
    if (NULL != p_instance_ctrl->p_callback)
    {
#if BSP_TZ_SECURE_BUILD

        /* p_callback can point to a secure function or a non-secure function. */
        if (!cmse_is_nsfptr(p_instance_ctrl->p_callback))
        {
            /* If p_callback is secure, then the project does not need to change security state. */
            p_instance_ctrl->p_callback(p_args);
        }
        else
        {
            /* If p_callback is Non-secure, then the project must change to Non-secure state in order to call the callback. */
            ctsu_prv_ns_callback p_callback = (ctsu_prv_ns_callback) (p_instance_ctrl->p_callback);
            p_callback(p_args);
        }

#else

        /* If the project is not Trustzone Secure, then it will never need to change security state in order to call the callback. */
        p_instance_ctrl->p_callback(p_args);
#endif
    }

    if (NULL != p_instance_ctrl->p_callback_memory)
    {
        /* Restore callback memory in case this is a nested interrupt. */
        *p_instance_ctrl->p_callback_memory = args;
    }

