xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    /* reset indexes */
    p_instance_ctrl->wr_index = 0;
    p_instance_ctrl->rd_index = 0;
#if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    p_instance_ctrl->serial_tuning_mutual_cnt = 0;
#endif
}

/***********************************************************************************************************************
 * ctsu_correction_process
 ***********************************************************************************************************************/
void ctsu_correction_process (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
#if (BSP_FEATURE_CTSU_VERSION == 2)
    uint32_t i;
    uint32_t j;
    uint16_t error_registance[CTSU_RANGE_NUM];
    uint32_t * p_trimb = (uint32_t *)(0x007fc3a8);
    uint32_t trimb;
    uint8_t  trimb_byte;
    uint8_t  rtrim;
    uint16_t base_value;
    uint16_t base_conv_dac;
    uint32_t ref_include_error;
    int32_t  x0;
    int32_t  x1;
    int32_t  y0;

    g_ctsu_correction_info.status = CTSU_CORRECTION_RUN;

    CTSU.CTSUCRA.BIT.MD0  = 1;
    CTSU.CTSUCRA.BIT.MD1  = 0;
    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 0;
    CTSU.CTSUMCH.BIT.MCA2 = 0;
    CTSU.CTSUMCH.BIT.MCA3 = 0;
    CTSU.CTSUCRA.BIT.LOAD = 1;

    /* Setting time of measurement */
    g_ctsu_correction_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10);

    /* Step1 : Get resistance value from TRIMB register. */
    trimb = * p_trimb;
    rtrim = CTSU.CTSUTRIMA.BIT.RTRIM;
    for (i = 0; i < CTSU_RANGE_NUM; i++)
    {
        trimb_byte          = (trimb >> (i * 8)) & CTSU_CORRECTION_TRIMB_MAX;
        error_registance[i] = (uint16_t) (trimb_byte & (uint8_t) (~CTSU_CORRECTION_TRIMB_SIGN_BIT));
        if (trimb_byte & CTSU_CORRECTION_TRIMB_SIGN_BIT)
        {
            if ((rtrim > CTSU_CORRECTION_RTRIM_THRESHOLD1) && (trimb_byte >= CTSU_CORRECTION_TRIMB_THRESHOLD1))
            {
                /* Minus2 : bit8(0.50) set 1 */
                error_registance[i] = (error_registance[i] | CTSU_CORRECTION_BIT8);
            }
            else
            {
                /* Plus   : bit9(1.00) set 1 */
                error_registance[i] = (error_registance[i] | CTSU_CORRECTION_BIT9);
            }
        }
        else
        {
            if ((rtrim < CTSU_CORRECTION_RTRIM_THRESHOLD2) && (trimb_byte <= CTSU_CORRECTION_TRIMB_THRESHOLD2))
            {
                /* Plus2  : bit7(0.25) and bit9(1.00) set 1 */
                error_registance[i] = (error_registance[i] | CTSU_CORRECTION_BIT7 | CTSU_CORRECTION_BIT9);
            }
            else
            {
                /* Minus : bit8(0.50) and bit7(0.25) set 1 */
                error_registance[i] = (error_registance[i] | CTSU_CORRECTION_BIT7 | CTSU_CORRECTION_BIT8);
            }
        }

        /* 6-bit left shift, 512 to 32768 */
        error_registance[i] = (uint16_t) (error_registance[i] << (CTSU_SHIFT_AMOUNT - 9));

 #if (CTSU_CFG_DIAG_SUPPORT_ENABLE == 1)
        g_ctsu_diag_info.error_registance[i] = error_registance[i];
 #endif
    }

    /* Step2-a : Measure the current input to the ICO by passing current through the internal resistance */
    /*           in each range. The theoretical value of the current is 12.5uA. */
    CTSU.CTSUCHACA.LONG        = 1;
    CTSU.CTSUCHACB.LONG        = 0;
    CTSU.CTSUCALIB.BIT.TSOC = 1;
    for (i = 0; i < CTSU_RANGE_NUM; i++)
    {
        if (CTSU_RANGE_20UA == i)
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 0;
            CTSU.CTSUCRA.BIT.ATUNE2 = 1;
        }
        else if (CTSU_RANGE_40UA == i)
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 1;
            CTSU.CTSUCRA.BIT.ATUNE2 = 0;
        }
        else if (CTSU_RANGE_80UA == i)
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 0;
            CTSU.CTSUCRA.BIT.ATUNE2 = 0;
        }
        else
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 1;
            CTSU.CTSUCRA.BIT.ATUNE2 = 1;
        }

        CTSU.CTSUCRA.BIT.LOAD = 3;
        ctsu_correction_measurement(p_instance_ctrl, &g_ctsu_correction_info.base_value[i]);
        CTSU.CTSUCRA.BIT.LOAD = 3;
    }

    /* Step3 : Measure by inputting each constant current from internal DAC to ICO. */
    CTSU.CTSUCRB.BIT.SSCNT      = 0;
    CTSU.CTSUCALIB.BIT.CCOCLK   = 0;
    CTSU.CTSUCALIB.BIT.CCOCALIB = 1;

    /* 1.25uA * (j + 1), SUCARRY is required for greater than 10uA */
    for (j = 0; j < CTSU_CORRECTION_POINT_NUM; j++)
    {
        CTSU.CTSUCRA.BIT.SDPSEL = 0;
        if (8 > j)
        {
            CTSU.CTSUSUCLKA.BIT.SUADJ0 = (uint32_t) (((j + 1) * CTSU_CORRECTION_SUMULTI) - 1);
        }
        else
        {
            CTSU.CTSUCRB.BIT.SSCNT     = 3;
            CTSU.CTSUCALIB.BIT.SUCARRY = 1;
            CTSU.CTSUSUCLKA.BIT.SUADJ0 = (uint32_t) (((j - 3) * CTSU_CORRECTION_SUMULTI) - 1);
        }

        CTSU.CTSUCRA.BIT.SDPSEL = 1;
        ctsu_correction_measurement(p_instance_ctrl, &g_ctsu_correction_info.dac_value[j]);
    }

    /* Step4 : Calculate the coefficient between step2 and step3. */
    for (i = 0; i < CTSU_RANGE_NUM; i++)
    {
        /* Linear interpolation calculation */
        base_value = g_ctsu_correction_info.base_value[i];
        j          = 1;
        while (1)
        {
            if ((base_value < g_ctsu_correction_info.dac_value[j]) || ((CTSU_CORRECTION_POINT_NUM - 1) == j))
            {
                y0 = (uint16_t) (CTSU_CORRECTION_STD_UNIT * (j + 1));
                x0 = g_ctsu_correction_info.dac_value[j];
                x1 = g_ctsu_correction_info.dac_value[j - 1];
                break;
            }

            j++;
        }

        base_conv_dac = (uint16_t) (y0 - ((CTSU_CORRECTION_STD_UNIT * (x0 - base_value)) / (x0 - x1)));

        /* Error rate calculation */
        ref_include_error = (uint32_t) (CTSU_CORRECTION_STD_VAL * (CTSU_CORRECTION_BIT16 - error_registance[i]));
        g_ctsu_correction_info.error_rate[i] = (uint16_t) (ref_include_error / base_conv_dac);

        for (j = 0; j < CTSU_CORRECTION_POINT_NUM; j++)
        {
            g_ctsu_correction_info.ref_value[i][j] =
                (uint16_t) ((CTSU_CORRECTION_STD_UNIT * (j + 1) * g_ctsu_correction_info.error_rate[i]) >>
                            CTSU_SHIFT_AMOUNT);
        }
    }

