xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
/***********************************************************************************************************************
 * ctsu_correction_data_get
 ***********************************************************************************************************************/
fsp_err_t ctsu_correction_data_get (ctsu_instance_ctrl_t * const p_instance_ctrl, uint16_t * p_data)
{
    uint32_t i;
    uint32_t j;
    uint16_t base_value;
    uint16_t base_conv_dac;
    int32_t  x0;
    int32_t  x1;
    int32_t  y0;
    ctsu_data_t temp_avg_data;
    fsp_err_t err = FSP_SUCCESS;

    if (g_ctsu_correction_info.scan_index < CTSU_CORRECTION_POINT_NUM)
    {
        temp_avg_data.int_data = g_ctsu_correction_info.dac_value[g_ctsu_correction_info.scan_index];
        ctsu_moving_average(&temp_avg_data,
                            *p_instance_ctrl->p_self_raw,
                            4);
        g_ctsu_correction_info.dac_value[g_ctsu_correction_info.scan_index] = temp_avg_data.int_data;
        g_ctsu_correction_info.scan_index++;
    }
    else
    {
        if (0 == g_ctsu_correction_info.ex_base_value)
        {
            g_ctsu_correction_info.ex_base_value  = *p_instance_ctrl->p_self_raw;
            g_ctsu_correction_info.update_counter = CTSU_CFG_TEMP_CORRECTION_TIME;
        }
        else
        {
            temp_avg_data.int_data = g_ctsu_correction_info.ex_base_value;
            ctsu_moving_average(&temp_avg_data, *p_instance_ctrl->p_self_raw,4);
            g_ctsu_correction_info.ex_base_value = temp_avg_data.int_data;
        }

        g_ctsu_correction_info.scan_index = 0;
        g_ctsu_correction_info.update_counter++;
    }

    /* Step4 : Calculate the coefficient between step2 and step3. */
    if (g_ctsu_correction_info.update_counter > CTSU_CFG_TEMP_CORRECTION_TIME)
    {
        /* Linear interpolation calculation */
        base_value = g_ctsu_correction_info.ex_base_value;
        j          = 1;
        while (1)
        {
            if ((base_value < g_ctsu_correction_info.dac_value[j]) || ((CTSU_CORRECTION_POINT_NUM - 1) == j))
            {
                y0 = (uint16_t) (CTSU_CORRECTION_STD_UNIT * (j + 1));
                x0 = g_ctsu_correction_info.dac_value[j];
                x1 = g_ctsu_correction_info.dac_value[j - 1];
                break;
            }

            j++;
        }

        base_conv_dac = (uint16_t) (y0 - ((CTSU_CORRECTION_STD_UNIT * (x0 - base_value)) / (x0 - x1)));

        /* Error rate calculation */
        g_ctsu_correction_info.error_rate[CTSU_RANGE_160UA] =
            (uint16_t) ((CTSU_CORRECTION_STD_EXREG << CTSU_SHIFT_AMOUNT) / base_conv_dac);

        for (j = 0; j < CTSU_CORRECTION_POINT_NUM; j++)
        {
            g_ctsu_correction_info.ref_value[CTSU_RANGE_160UA][j] =
                (uint16_t) ((CTSU_CORRECTION_STD_UNIT * (j + 1) *
                             g_ctsu_correction_info.error_rate[CTSU_RANGE_160UA]) >> CTSU_SHIFT_AMOUNT);
            for (i = 0; i < CTSU_RANGE_NUM - 1; i++)
            {
                g_ctsu_correction_info.ref_value[i][j] =
                    (uint16_t) ((g_ctsu_correction_info.ref_value[CTSU_RANGE_160UA][j] *
                                 g_ctsu_correction_info.range_ratio[i]) >> CTSU_SHIFT_AMOUNT);
            }
        }

  #if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
        /* Initialization of sensor counter auto correction table register number */
        CTSU.CTSUOPT.BIT.SCACTB = 0;

        ctsu_auto_correction_register_set (p_instance_ctrl);
  #endif

        g_ctsu_correction_info.update_counter = 0;
  #if (CTSU_CFG_CALIB_RTRIM_SUPPORT == 1)
        err = ctsu_correction_calib_rtrim(p_instance_ctrl, p_data);
        if (FSP_ERR_ALREADY_OPEN != err)
        {
            R_ADC_Close(0);
        }
        if (FSP_SUCCESS != err)
        {
            err = FSP_ERR_ABORTED;
        }
  #endif
    }
    else
    {
        /* Indicates that ADC measurement was not performed. */
        *p_data = CTSU_COUNT_MAX;
    }

    CTSU.CTSUCRA.LONG = g_ctsu_temp_reg_ctsucra;
#if (CTSU_CFG_TEMP_CORRECTION_TS < 32)
    CTSU.CTSUCHACA.LONG &= (uint32_t) ~(1 << CTSU_CFG_TEMP_CORRECTION_TS);
#else
    CTSU.CTSUCHACB.LONG &= (uint32_t) ~(1 << (CTSU_CFG_TEMP_CORRECTION_TS - 32));
#endif

    return err;
}

  #if (CTSU_CFG_CALIB_RTRIM_SUPPORT == 1)

/***********************************************************************************************************************
 * ctsu_correction_calib_rtrim
 ***********************************************************************************************************************/
fsp_err_t ctsu_correction_calib_rtrim (ctsu_instance_ctrl_t * const p_instance_ctrl, uint16_t * p_data)
{
    uint16_t               i;
    uint16_t               adctdr_result;
    uint16_t               adctdr_ave;
    uint32_t               adctdr_sum;
    int16_t                diff;
    int16_t                dir  = 0;
    uint16_t               comp = 0;
    adc_cfg_t              open_cfg;
    adc_ch_cfg_t           ctrl_cfg;
    fsp_err_t              err = FSP_SUCCESS;
    adc_err_t              poll;

    /* TSCAP AD/C AN008 Setting */
    CTSU.CTSUADCC.LONG = 1;

    /* Setting for A/D convert mode */
    open_cfg.conv_speed = ADC_CONVERT_SPEED_DEFAULT;
    open_cfg.alignment = ADC_ALIGN_RIGHT;
    open_cfg.add_cnt = ADC_ADD_OFF;                 /* addition is turned off for chans/sensors */
    open_cfg.clearing = ADC_CLEAR_AFTER_READ_OFF;
    open_cfg.trigger = ADC_TRIG_SOFTWARE;           /* Software trigger */
    open_cfg.trigger_groupb = ADC_TRIG_NONE;        /* Trigger none when without group mode */
    open_cfg.priority = 0;                          /* S12ADIO no interrupt(polling) */
    open_cfg.priority_groupb = 0;                   /* S12GBADI no interrupt */
    err = (fsp_err_t) R_ADC_Open (0, ADC_MODE_SS_ONE_CH, &open_cfg, FIT_NO_FUNC);
    if (ADC_ERR_AD_NOT_CLOSED == (adc_err_t) err)
    {
        return FSP_ERR_ALREADY_OPEN;
    }
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* choice A/D port(allow A/D convert) */
    ctrl_cfg.chan_mask = ADC_MASK_CH8;
    ctrl_cfg.chan_mask_groupb = ADC_MASK_GROUPB_OFF;
    ctrl_cfg.priority_groupa = ADC_GRPA_PRIORITY_OFF;
    ctrl_cfg.diag_method = ADC_DIAG_OFF;
    ctrl_cfg.add_mask = ADC_MASK_ADD_OFF;
    ctrl_cfg.signal_elc = ADC_ELC_ALL_SCANS_DONE;
    err = (fsp_err_t) R_ADC_Control (0, ADC_CMD_ENABLE_CHANS, &ctrl_cfg);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Self single scan mode */
    CTSU.CTSUCRA.BIT.LOAD = 1;
    CTSU.CTSUCRA.BIT.MD0  = 0;
    CTSU.CTSUCRA.BIT.MD1  = 0;

    /* Set Channel */
   #if (CTSU_CFG_TEMP_CORRECTION_TS < 32)
    CTSU.CTSUCHACA.LONG  |= (uint32_t) (1 << CTSU_CFG_TEMP_CORRECTION_TS);
    CTSU.CTSUCHTRCA.LONG &= (uint32_t) ~(1 << CTSU_CFG_TEMP_CORRECTION_TS);
   #else
    CTSU.CTSUCHACB.LONG  |= (uint32_t) (1 << (CTSU_CFG_TEMP_CORRECTION_TS - 32));
    CTSU.CTSUCHTRCB.LONG &= (uint32_t) ~(1 << (CTSU_CFG_TEMP_CORRECTION_TS - 32));
   #endif
    CTSU.CTSUMCH.BIT.MCH0 = CTSU_CFG_TEMP_CORRECTION_TS;

    /* 150uA current measurement */
    CTSU.CTSUCRA.BIT.DCMODE = 1;
    CTSU.CTSUCRA.BIT.DCBACK = 1;
    CTSU.CTSUSO.BIT.SO      = CTSU_CALIB_CTSUSO;
    CTSU.CTSUCRA.BIT.CSW    = 0;
    CTSU.CTSUCALIB.BIT.DRV  = 1;

    /* ADC scan */
    while (!comp)
    {
        adctdr_sum = 0;
        for (i = 0; i < CTSU_CALIB_AVERAGE_TIME; i++)
        {
            /* Software trigger start scan */
            err = (fsp_err_t) R_ADC_Control (0, ADC_CMD_SCAN_NOW, FIT_NO_PTR);
            FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

            /* Polling for scan complete */
            do
            {
                poll = R_ADC_Control (0, ADC_CMD_CHECK_SCAN_DONE, FIT_NO_PTR);
            } while (ADC_ERR_SCAN_NOT_DONE == poll);

            /* Read A/D data then scan normal end */
            err = (fsp_err_t) R_ADC_Read (0, ADC_REG_CH8, &adctdr_result);
            FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
            adctdr_sum += adctdr_result;
        }

        adctdr_ave = (uint16_t) ((adctdr_sum * 10) / CTSU_CALIB_AVERAGE_TIME);
        diff       = (int16_t) ((adctdr_ave - CTSU_CALIB_REF) / 10);

        /* The change unit of the voltage by the RTRIM register is about 4mV (4096 * 4) = 16.384 */
        if (diff > CTSU_CALIB_THRESHOLD)
        {
            if (0 <= dir)
            {
                CTSU.CTSUTRIMA.BIT.RTRIM = (uint8_t) (CTSU.CTSUTRIMA.BIT.RTRIM + 1);
                dir = 1;
            }
            else
            {
                comp = 1;
            }
        }
        else if (diff < -(CTSU_CALIB_THRESHOLD))
        {
            if (0 >= dir)
            {
                CTSU.CTSUTRIMA.BIT.RTRIM = (uint8_t) (CTSU.CTSUTRIMA.BIT.RTRIM - 1);
                dir = -1;
            }
            else
            {
                comp = 1;
            }
        }
        else
        {
            comp = 1;
        }
    }

    /* Restore register settings */
    CTSU.CTSUCALIB.BIT.DRV  = 0;
    CTSU.CTSUCRA.BIT.CSW    = 1;
    CTSU.CTSUCRA.BIT.DCMODE = 0;
    CTSU.CTSUCRA.BIT.DCBACK = 0;

    /* Indicates that ADC measurement was performed  */
    *p_data = CTSU.CTSUTRIMA.BIT.RTRIM;

    /* Close ADC for CTSU TSCAP */
    R_ADC_Close(0);

