xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    if (CTSU_DIAG_SSCG == g_ctsu_diag_info.state)
    {
        ctsu_diag_sscg_scan_start();
    }

    if (CTSU_DIAG_DAC == g_ctsu_diag_info.state)
    {
        ctsu_diag_dac_scan_start(p_instance_ctrl);
    }
}

/***********************************************************************************************************************
 * ctsu_diag_data_get1
 ***********************************************************************************************************************/
static fsp_err_t ctsu_diag_data_get1 (void)
{
    fsp_err_t err;

    /* data get */
    if (CTSU_DIAG_OVER_VOLTAGE == g_ctsu_diag_info.state)
    {
        ctsu_diag_ldo_over_voltage_data_get();

        g_ctsu_diag_info.state = CTSU_DIAG_CCO_HIGH;
    }
    else if (CTSU_DIAG_CCO_HIGH == g_ctsu_diag_info.state)
    {
        ctsu_diag_oscillator_high_data_get();

        g_ctsu_diag_info.state = CTSU_DIAG_CCO_LOW;
    }
    else if (CTSU_DIAG_CCO_LOW == g_ctsu_diag_info.state)
    {
        ctsu_diag_oscillator_low_data_get();

        g_ctsu_diag_info.state = CTSU_DIAG_SSCG;
    }
    else if (CTSU_DIAG_SSCG == g_ctsu_diag_info.state)
    {
        ctsu_diag_sscg_data_get();

        g_ctsu_diag_info.state = CTSU_DIAG_DAC;
    }
    else if (CTSU_DIAG_DAC == g_ctsu_diag_info.state)
    {
        ctsu_diag_dac_data_get();
        if (CTSU_TUNING_INCOMPLETE == g_ctsu_diag_info.tuning)
        {
            g_ctsu_diag_info.state = CTSU_DIAG_DAC;
        }
        else
        {
            g_ctsu_diag_info.loop_count++;
            if (6 <= g_ctsu_diag_info.loop_count)
            {
                g_ctsu_diag_info.state      = CTSU_DIAG_COMPLETE;
                g_ctsu_diag_info.loop_count = 0;
            }
        }
    }
    else
    {
    }

    /* register restore */
    CTSU.CTSUCR0.BYTE      = g_ctsu_diag_reg.ctsucr0;
    CTSU.CTSUCR1.BYTE      = g_ctsu_diag_reg.ctsucr1;
    CTSU.CTSUSDPRS.BYTE    = g_ctsu_diag_reg.ctsusdprs;
    CTSU.CTSUSST.BYTE      = g_ctsu_diag_reg.ctsusst;
    CTSU.CTSUCHAC0.BYTE    = g_ctsu_diag_reg.ctsuchac0;
    CTSU.CTSUCHAC1.BYTE    = g_ctsu_diag_reg.ctsuchac1;
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 3)
    CTSU.CTSUCHAC2.BYTE    = g_ctsu_diag_reg.ctsuchac2;
#endif
    CTSU.CTSUCHTRC0.BYTE   = g_ctsu_diag_reg.ctsuchtrc0;
    CTSU.CTSUCHTRC1.BYTE   = g_ctsu_diag_reg.ctsuchtrc1;
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 3)
    CTSU.CTSUCHTRC2.BYTE   = g_ctsu_diag_reg.ctsuchtrc2;
#endif
    CTSU.CTSUDCLKC.BYTE    = g_ctsu_diag_reg.ctsudclkc;
    CTSU.CTSUERRS.WORD = 0;

    if (CTSU_DIAG_COMPLETE == g_ctsu_diag_info.state)
    {
        err = FSP_SUCCESS;
    }
    else
    {
        err = FSP_ERR_CTSU_DIAG_NOT_YET;
    }

    return err;
}

static void ctsu_diag_ldo_over_voltage_scan_start (void)
{
    uint32_t pclkb_mhz;
    uint32_t ctsu_sdpa;

    /* Set power on */
    CTSU.CTSUCR1.BYTE = ((CTSU_CFG_LOW_VOLTAGE_MODE << 2) | (CTSU_CSW_ON << 1) | CTSU_PON_ON);

    /* Synchronous Noise Reduction Setting */
    CTSU.CTSUSDPRS.BYTE = ((CTSU_SOFF_ON << 6) | (CTSU_PRMODE_62_PULSES << 4) | CTSU_PRRATIO_RECOMMEND);

    /* High Pass Noise Reduction- ALWAYS 0x30 as per HW Manual */
    CTSU.CTSUDCLKC.BYTE = ((CTSU_SSCNT << 4) | CTSU_SSMOD);

    /* Sensor Stabilization- ALWAYS 0x10 as per HW Manual */
    CTSU.CTSUSST.BYTE = (CTSU_SST_RECOMMEND);

    /* Since CLK is rewritten by correction, set here. */
    CTSU.CTSUCR1.BYTE |= (uint8_t) (CTSU_CFG_PCLK_DIVISION << 4);

    pclkb_mhz = BSP_PCLKB_HZ / CTSU_PCLKB_FREQ_MHZ;
    if (CTSU_PCLKB_FREQ_RANGE1 >= pclkb_mhz)
    {
        CTSU.CTSUCR1.BYTE |= (0 << 4);
        ctsu_sdpa          = pclkb_mhz - 1;
    }
    else if ((CTSU_PCLKB_FREQ_RANGE1 < pclkb_mhz) && (CTSU_PCLKB_FREQ_RANGE2 >= pclkb_mhz))
    {
        CTSU.CTSUCR1.BYTE |= (1 << 4);
        ctsu_sdpa          = (pclkb_mhz / 2) - 1;
    }
    else
    {
        CTSU.CTSUCR1.BYTE |= (2 << 4);
        ctsu_sdpa          = (pclkb_mhz / 4) - 1;
    }

    CTSU.CTSUCR1.BYTE   |= (CTSU_MODE_SELF_MULTI_SCAN << 6);
    CTSU.CTSUCHAC0.BYTE  = 0x01;
    CTSU.CTSUCHAC1.BYTE  = 0x00;
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 3)
    CTSU.CTSUCHAC2.BYTE  = 0x00;
#endif
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 4)
    CTSU.CTSUCHAC3.BYTE  = 0x00;
#endif
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 5)
    CTSU.CTSUCHAC4.BYTE  = 0x00;
#endif
    CTSU.CTSUCHTRC0.BYTE = 0x00;
    CTSU.CTSUCHTRC1.BYTE = 0x00;
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 3)
    CTSU.CTSUCHTRC2.BYTE = 0x00;
#endif
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 4)
    CTSU.CTSUCHTRC3.BYTE = 0x00;
#endif
#if (BSP_FEATURE_CTSU_CTSUCHAC_REGISTER_COUNT >= 5)
    CTSU.CTSUCHTRC4.BYTE = 0x00;
#endif

    /* Correction measurement setting */
    CTSU.CTSUERRS.BIT.CTSUTSOC = 1;
    g_ctsu_diag_info.icomp = 0;

    g_ctsu_diag_info.ctsuwr.ctsussc = (CTSU_SSDIV_0500 << 8);
    g_ctsu_diag_info.ctsuwr.ctsuso0 = CTSU_DIAG_DAC_SO_MAX;
    g_ctsu_diag_info.ctsuwr.ctsuso1 = (uint16_t) ((CTSU_ICOG_66 << 13) | (ctsu_sdpa << 8) | CTSU_RICOA_RECOMMEND);
}

static void ctsu_diag_ldo_over_voltage_data_get (void)
{
    /* Nothing */
}

static fsp_err_t ctsu_diag_ldo_over_voltage_result (void)
{
    if (1 != g_ctsu_diag_info.icomp)
    {
        return FSP_ERR_CTSU_DIAG_LDO_OVER_VOLTAGE;
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_oscillator_high_scan_start (void)
{
    uint32_t ctsu_sdpa;
    uint32_t pclkb_mhz;

    /* Set power on */
    CTSU.CTSUCR1.BYTE = ((CTSU_CFG_LOW_VOLTAGE_MODE << 2) | (CTSU_CSW_ON << 1) | CTSU_PON_ON);

    /* Synchronous Noise Reduction Setting */
    CTSU.CTSUSDPRS.BYTE = ((CTSU_SOFF_ON << 6) | (CTSU_PRMODE_62_PULSES << 4) | CTSU_PRRATIO_RECOMMEND);

    /* High Pass Noise Reduction- ALWAYS 0x30 as per HW Manual */
    CTSU.CTSUDCLKC.BYTE = ((CTSU_SSCNT << 4) | CTSU_SSMOD);

    /* Sensor Stabilization- ALWAYS 0x10 as per HW Manual */
    CTSU.CTSUSST.BYTE = (CTSU_SST_RECOMMEND);

    /* Since CLK is rewritten by correction, set here. */
    CTSU.CTSUCR1.BYTE |= (uint8_t) (CTSU_CFG_PCLK_DIVISION << 4);

    pclkb_mhz = BSP_PCLKB_HZ / CTSU_PCLKB_FREQ_MHZ;
    if (CTSU_PCLKB_FREQ_RANGE1 >= pclkb_mhz)
    {
        CTSU.CTSUCR1.BYTE |= (0 << 4);
        ctsu_sdpa          = pclkb_mhz - 1;
    }
    else if ((CTSU_PCLKB_FREQ_RANGE1 < pclkb_mhz) && (CTSU_PCLKB_FREQ_RANGE2 >= pclkb_mhz))
    {
        CTSU.CTSUCR1.BYTE |= (1 << 4);
        ctsu_sdpa          = (pclkb_mhz / 2) - 1;
    }
    else
    {
        CTSU.CTSUCR1.BYTE |= (2 << 4);
        ctsu_sdpa          = (pclkb_mhz / 4) - 1;
    }

