xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    return err;
}

static void ctsu_diag_regi_store2 (void)
{
    g_ctsu_diag_reg.ctsucra    = CTSU.CTSUCRA.LONG;
    g_ctsu_diag_reg.ctsucrb    = CTSU.CTSUCRB.LONG;
    g_ctsu_diag_reg.ctsuchaca  = CTSU.CTSUCHACA.LONG;
    g_ctsu_diag_reg.ctsuchacb  = CTSU.CTSUCHACB.LONG;
    g_ctsu_diag_reg.ctsuchtrca = CTSU.CTSUCHTRCA.LONG;
    g_ctsu_diag_reg.ctsuchtrcb = CTSU.CTSUCHTRCB.LONG;
    g_ctsu_diag_reg.ctsumch    = CTSU.CTSUMCH.LONG;
    g_ctsu_diag_reg.ctsucalib  = CTSU.CTSUCALIB.LONG;
    g_ctsu_diag_reg.ctsusuclka = CTSU.CTSUSUCLKA.LONG;
    g_ctsu_diag_reg.ctsusuclkb = CTSU.CTSUSUCLKB.LONG;
}

static void ctsu_diag_regi_restore2 (void)
{
    /* register restore */
    CTSU.CTSUCRA.LONG    = g_ctsu_diag_reg.ctsucra;
    CTSU.CTSUCRB.LONG    = g_ctsu_diag_reg.ctsucrb;
    CTSU.CTSUCHACA.LONG  = g_ctsu_diag_reg.ctsuchaca;
    CTSU.CTSUCHACB.LONG  = g_ctsu_diag_reg.ctsuchacb;
    CTSU.CTSUCHTRCA.LONG = g_ctsu_diag_reg.ctsuchtrca;
    CTSU.CTSUCHTRCB.LONG = g_ctsu_diag_reg.ctsuchtrcb;
    CTSU.CTSUMCH.LONG    = g_ctsu_diag_reg.ctsumch;
    CTSU.CTSUCALIB.LONG  = g_ctsu_diag_reg.ctsucalib;
    CTSU.CTSUSUCLKA.LONG = g_ctsu_diag_reg.ctsusuclka;
    CTSU.CTSUSUCLKB.LONG = g_ctsu_diag_reg.ctsusuclkb;
}

static fsp_err_t ctsu_diag_output_voltage_scan_start (ctsu_instance_ctrl_t * const p_instance_ctrl)
{
    uint8_t                k;
    adc_cfg_t              open_cfg;
    adc_ch_cfg_t           ctrl_cfg;
    fsp_err_t              err;
    adc_err_t              poll;

    /* TSCAP AD/C AN008 Setting */
    CTSU.CTSUADCC.LONG = 1;

    /* Setting for A/D convert mode */
    open_cfg.conv_speed = ADC_CONVERT_SPEED_DEFAULT;
    open_cfg.alignment = ADC_ALIGN_RIGHT;
    open_cfg.add_cnt = ADC_ADD_OFF;                 /* addition is turned off for chans/sensors */
    open_cfg.clearing = ADC_CLEAR_AFTER_READ_OFF;
    open_cfg.trigger = ADC_TRIG_SOFTWARE;           /* Software trigger */
    open_cfg.trigger_groupb = ADC_TRIG_NONE;        /* Trigger none when without group mode */
    open_cfg.priority = 0;                          /* S12ADIO no interrupt(polling) */
    open_cfg.priority_groupb = 0;                   /* S12GBADI no interrupt */
    err = (fsp_err_t) R_ADC_Open (0, ADC_MODE_SS_ONE_CH, &open_cfg, FIT_NO_FUNC);
    if (ADC_ERR_AD_NOT_CLOSED == (adc_err_t) err)
    {
        return FSP_ERR_ALREADY_OPEN;
    }
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* choice A/D port(allow A/D convert) */
    ctrl_cfg.chan_mask = ADC_MASK_CH8;
    ctrl_cfg.chan_mask_groupb = ADC_MASK_GROUPB_OFF;
    ctrl_cfg.priority_groupa = ADC_GRPA_PRIORITY_OFF;
    ctrl_cfg.diag_method = ADC_DIAG_OFF;
    ctrl_cfg.add_mask = ADC_MASK_ADD_OFF;
    ctrl_cfg.signal_elc = ADC_ELC_ALL_SCANS_DONE;
    err = (fsp_err_t) R_ADC_Control (0, ADC_CMD_ENABLE_CHANS, &ctrl_cfg);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* CTSU setting */
    CTSU.CTSUCRA.BIT.PUMPON = 1;
    CTSU.CTSUCRA.BIT.CSW    = 1;
    CTSU.CTSUCRA.BIT.PON    = 1;
    CTSU.CTSUCALIB.LONG     = 0;

    /* Self single scan mode */
    CTSU.CTSUCRA.BIT.MD0 = 0;
    CTSU.CTSUCRA.BIT.MD1 = 0;
    CTSU.CTSUSO.LONG     = CTSU_DIAG_DAC_INIT_0;
    CTSU.CTSUSO.LONG     = CTSU_DIAG_DAC_INIT_1;
    CTSU.CTSUSO.LONG     = CTSU_DIAG_DAC_INIT_2;
    CTSU.CTSUSO.LONG     = CTSU_DIAG_DAC_INIT_3;

    /* LDO setting */
    CTSU.CTSUCALIB.BIT.DRV = 0;

    for (k = 0; k < 8; k++)
    {
        switch (k)
        {
            case 0:
            {
                /*select normal mode */
                CTSU.CTSUCRA.BIT.LOAD = 0;

                /* LDO Setting (20uA)*/
                CTSU.CTSUCRA.BIT.ATUNE1 = 0;
                CTSU.CTSUCRA.BIT.ATUNE2 = 1;
                break;
            }

            case 1:
            {
                /*select normal mode */
                CTSU.CTSUCRA.BIT.LOAD = 0;

                /* LDO Setting (40uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 1;
                CTSU.CTSUCRA.BIT.ATUNE2 = 0;
                break;
            }

            case 2:
            {
                /*select normal mode */
                CTSU.CTSUCRA.BIT.LOAD = 0;

                /* LDO Setting (80uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 0;
                CTSU.CTSUCRA.BIT.ATUNE2 = 0;
                break;
            }

            case 3:
            {
                /*select normal mode */
                CTSU.CTSUCRA.BIT.LOAD = 0;

                /* LDO Setting (160uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 1;
                CTSU.CTSUCRA.BIT.ATUNE2 = 1;
                break;
            }

            case 4:
            {
                /*select normal mode */
                CTSU.CTSUCRA.BIT.LOAD = 1;
                CTSU.CTSUCRA.BIT.LOAD = 3;

                /* LDO Setting (20uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 0;
                CTSU.CTSUCRA.BIT.ATUNE2 = 1;
                break;
            }

            case 5:
            {
                /* select Resistive load mode */
                CTSU.CTSUCRA.BIT.LOAD = 1;
                CTSU.CTSUCRA.BIT.LOAD = 3;

                /* LDO Setting (40uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 1;
                CTSU.CTSUCRA.BIT.ATUNE2 = 0;
                break;
            }

            case 6:
            {
                /* select Resistive load mode */
                CTSU.CTSUCRA.BIT.LOAD = 1;
                CTSU.CTSUCRA.BIT.LOAD = 3;

                /* LDO Setting (80uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 0;
                CTSU.CTSUCRA.BIT.ATUNE2 = 0;
                break;
            }

            case 7:
            {
                /* select Resistive load mode */
                CTSU.CTSUCRA.BIT.LOAD = 1;
                CTSU.CTSUCRA.BIT.LOAD = 3;

                /* LDO Setting (160uA) */
                CTSU.CTSUCRA.BIT.ATUNE1 = 1;
                CTSU.CTSUCRA.BIT.ATUNE2 = 1;
                break;
            }

            default:
            {
                break;
            }
        }

        CTSU.CTSUCALIB.BIT.DRV = 1;

        /* Software trigger start scan */
        err = (fsp_err_t) R_ADC_Control (0, ADC_CMD_SCAN_NOW, FIT_NO_PTR);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

        /* Polling for scan complete */
        do
        {
            poll = R_ADC_Control (0, ADC_CMD_CHECK_SCAN_DONE, FIT_NO_PTR);
        } while (ADC_ERR_SCAN_NOT_DONE == poll);

        /* Read A/D data then scan normal end */
        err = (fsp_err_t) R_ADC_Read (0, ADC_REG_CH8, &g_ctsu_diag_info.output_voltage_cnt[k]);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
    }
    R_ADC_Close(0);

