xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    return err;
}

static fsp_err_t ctsu_diag_output_voltage_result (void)
{
    uint8_t k;

    for (k = 0; k < 8; k++)
    {
        if ((g_ctsu_diag_info.output_voltage_cnt[k] <= CTSU_DIAG_TSCAP_RANGE_LOW) ||
            (g_ctsu_diag_info.output_voltage_cnt[k] >= CTSU_DIAG_TSCAP_RANGE_HIGH))
        {
            return FSP_ERR_CTSU_DIAG_OUTPUT_VOLTAGE;
        }
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_over_voltage_scan_start (void)
{
    g_ctsu_diag_info.icomp0_value = 1;

    CTSU.CTSUCRA.BIT.PUMPON  = 1;
    CTSU.CTSUCRA.BIT.CSW     = 1;
    CTSU.CTSUCRA.BIT.PON     = 1;
    CTSU.CTSUCALIB.LONG      = 0;
    CTSU.CTSUCALIB.BIT.DRV   = 1;
    CTSU.CTSUCALIB.BIT.DCOFF = 1;

    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCRA.BIT.ATUNE1 = 1;
    CTSU.CTSUCRA.BIT.ATUNE2 = 0;
    CTSU.CTSUCRA.BIT.LOAD   = 3;

    CTSU.CTSUSR.BIT.ICOMPRST = 1;
    CTSU.CTSUCALIB.LONG      = CTSU_DIAG_CURRENT_CLIB_REG;
    CTSU.CTSUSO.LONG         = 0;
    CTSU.CTSUSO.LONG         = 0;

    R_BSP_SoftwareDelay(1, BSP_DELAY_MILLISECS);

    if (CTSU.CTSUSR.BIT.ICOMP0 != 0)
    {
        g_ctsu_diag_info.icomp0_value = 0;
    }

    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCRA.BIT.ATUNE1 = 1;
    CTSU.CTSUCRA.BIT.ATUNE2 = 1;
    CTSU.CTSUCRA.BIT.LOAD   = 3;

    CTSU.CTSUCALIB.LONG = CTSU_DIAG_CURRENT_CLIB_REG;

    CTSU.CTSUCRA.BIT.LOAD = 2;
    CTSU.CTSUSO.LONG      = CTSU_DIAG_DAC_DATA_MAX_2;
    CTSU.CTSUSO.LONG      = CTSU_DIAG_DAC_DATA_MAX_3;

    R_BSP_SoftwareDelay(1, BSP_DELAY_MILLISECS);

    if (CTSU.CTSUSR.BIT.ICOMP0 != 1)
    {
        g_ctsu_diag_info.icomp0_value = 0;
    }

    CTSU.CTSUSR.BIT.ICOMPRST = 1;

    R_BSP_SoftwareDelay(1, BSP_DELAY_MILLISECS);

    if (CTSU.CTSUSR.BIT.ICOMP0 != 1)
    {
        g_ctsu_diag_info.icomp0_value = 0;
    }

    /* 30kohm setting */
    CTSU.CTSUCRA.BIT.ATUNE1 = 1;
    CTSU.CTSUCRA.BIT.ATUNE2 = 0;
    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCALIB.LONG     = CTSU_DIAG_CURRENT_CLIB_REG;

    /* 0uA setting */
    CTSU.CTSUSO.LONG = 0x00000000;
    CTSU.CTSUSO.LONG = 0x00000000;

    R_BSP_SoftwareDelay(1, BSP_DELAY_MILLISECS);

    if (CTSU.CTSUSR.BIT.ICOMP0 != 1)
    {
        g_ctsu_diag_info.icomp0_value = 0;
    }

    CTSU.CTSUSR.BIT.ICOMPRST = 1;

    R_BSP_SoftwareDelay(1, BSP_DELAY_MILLISECS);

    if (CTSU.CTSUSR.BIT.ICOMP0 != 0)
    {
        g_ctsu_diag_info.icomp0_value = 0;
    }
}

static fsp_err_t ctsu_diag_over_voltage_result (void)
{
    if (0 == g_ctsu_diag_info.icomp0_value)
    {
        return FSP_ERR_CTSU_DIAG_OVER_VOLTAGE;
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_over_current_scan_start (void)
{
    CTSU.CTSUCALIB.LONG      = 0;
    CTSU.CTSUCALIB.BIT.DRV   = 0;
    CTSU.CTSUCALIB.BIT.DCOFF = 0;
    CTSU.CTSUCRA.BIT.ATUNE1  = 0;
    CTSU.CTSUCRA.BIT.ATUNE2  = 0;
    CTSU.CTSUCRA.BIT.LOAD    = 0;
    CTSU.CTSUSR.BIT.ICOMPRST = 1;

    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 0;
    CTSU.CTSUMCH.BIT.MCA2 = 0;
    CTSU.CTSUMCH.BIT.MCA3 = 0;

    CTSU.CTSUCRA.BIT.MD0 = 1;
    CTSU.CTSUCRA.BIT.MD1 = 0;


    CTSU.CTSUCHACA.LONG  = g_ctsu_diag_info.chaca;
    CTSU.CTSUCHACB.LONG  = g_ctsu_diag_info.chacb;
    CTSU.CTSUCHTRCA.LONG = 0;
    CTSU.CTSUCHTRCB.LONG = 0;

    CTSU.CTSUCRA.BIT.CSW = 0;
    CTSU.CTSUCRA.BIT.PON = 0;

    /* TSCAP discharge process */
    R_Set_CTSU_TSCAP_Discharge();
    R_BSP_SoftwareDelay(10,BSP_DELAY_MICROSECS);
    R_Set_CTSU_TSCAP_Charge();

    CTSU.CTSUCRA.BIT.CSW = 1;
    CTSU.CTSUCRA.BIT.PON = 1;
}

static fsp_err_t ctsu_diag_over_current_result (void)
{
    if (g_ctsu_diag_info.icomp1_value == 0)
    {
        return FSP_ERR_CTSU_DIAG_OVER_CURRENT;
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_load_resistance_scan_start (void)
{
    /* CTSU setting */
    CTSU.CTSUCRA.BIT.PUMPON = 1;
    CTSU.CTSUCRA.BIT.CSW    = 1;
    CTSU.CTSUCRA.BIT.PON    = 1;

    CTSU.CTSUCRA.BIT.SDPSEL    = 1;
    CTSU.CTSUCRA.BIT.PCSEL     = 1;
    CTSU.CTSUCRB.BIT.SST       = CTSU_SST_RECOMMEND;
    CTSU.CTSUCALIB.BIT.CCOCLK  = 0;
    CTSU.CTSUCALIB.BIT.SUCLKEN = 0;

    CTSU.CTSUCRA.BIT.MD0  = 1;
    CTSU.CTSUCRA.BIT.MD1  = 0;
    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 0;
    CTSU.CTSUMCH.BIT.MCA2 = 0;
    CTSU.CTSUMCH.BIT.MCA3 = 0;
    CTSU.CTSUCRA.BIT.LOAD = 1;

    /* Setting time of measurement */
    g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10);

    CTSU.CTSUCHACA.LONG  = 1;
    CTSU.CTSUCHACB.LONG  = 0;
    CTSU.CTSUCHTRCA.LONG = 0;
    CTSU.CTSUCHTRCB.LONG = 0;

    CTSU.CTSUCALIB.BIT.TSOC = 1;

    switch (g_ctsu_diag_info.loop_count)
    {
        case 0:
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 1;
            CTSU.CTSUCRA.BIT.ATUNE2 = 1; // 7.5Kohm 160uA
            break;
        }

        case 1:
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 0;
            CTSU.CTSUCRA.BIT.ATUNE2 = 0; // 15Kohm 80uA
            break;
        }

        case 2:
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 1;
            CTSU.CTSUCRA.BIT.ATUNE2 = 0; // 30Kohm 40uA
            break;
        }

        case 3:
        {
            CTSU.CTSUCRA.BIT.ATUNE1 = 0;
            CTSU.CTSUCRA.BIT.ATUNE2 = 1; // 60Kohm 20uA
            break;
        }

        default:
        {
            break;
        }
    }

    CTSU.CTSUCRA.BIT.LOAD = 3;
}

static void ctsu_diag_load_resistance_data_get (void)
{
    g_ctsu_diag_info.load_resistance[g_ctsu_diag_info.loop_count] = (uint16_t) g_ctsu_diag_info.ctsuscnt[0];

    g_ctsu_diag_info.load_resistance[g_ctsu_diag_info.loop_count] =
        (uint16_t) ((((uint32_t) g_ctsu_diag_info.load_resistance[g_ctsu_diag_info.loop_count]) *
                     g_ctsu_diag_info.error_registance[3 - g_ctsu_diag_info.loop_count]) >> (CTSU_SHIFT_AMOUNT));

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 0)
    ctsu_correction_calc_t calc;
    calc.snum  = CTSU_SNUM_RECOMMEND;
    calc.range = CTSU_RANGE_40UA;
    calc.md    = CTSU_MODE_DIAGNOSIS_SCAN;
    ctsu_correction_calc(&g_ctsu_diag_info.load_resistance[g_ctsu_diag_info.loop_count],
                         g_ctsu_diag_info.load_resistance[g_ctsu_diag_info.loop_count],
                         &calc);
#endif
    g_ctsu_diag_info.loop_count++;
}

static fsp_err_t ctsu_diag_load_resistance_result (void)
{
    uint8_t k;

    for (k = 0; k < 4; k++)
    {
        if ((g_ctsu_diag_info.load_resistance[k] > CTSU_CFG_DIAG_LOAD_REISTER_MIN) &&
            (g_ctsu_diag_info.load_resistance[k] < CTSU_CFG_DIAG_LOAD_REISTER_MAX))
        {
        }
        else
        {
            return FSP_ERR_CTSU_DIAG_LOAD_RESISTANCE;
        }
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_current_source_scan_start (void)
{
    /* CTSU setting */
    CTSU.CTSUCRA.BIT.PUMPON = 1;
    CTSU.CTSUCRA.BIT.CSW    = 1;
    CTSU.CTSUCRA.BIT.PON    = 1;

    CTSU.CTSUCRA.BIT.SDPSEL    = 1;
    CTSU.CTSUCRA.BIT.PCSEL     = 1;
    CTSU.CTSUCRB.BIT.SST       = CTSU_SST_RECOMMEND;
    CTSU.CTSUCALIB.BIT.CCOCLK  = 0;
    CTSU.CTSUCALIB.BIT.SUCLKEN = 0;

    CTSU.CTSUCRA.BIT.MD0  = 1;
    CTSU.CTSUCRA.BIT.MD1  = 0;
    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 0;
    CTSU.CTSUMCH.BIT.MCA2 = 0;
    CTSU.CTSUMCH.BIT.MCA3 = 0;

