xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    CTSU.CTSUCHACA.LONG  = 1;
    CTSU.CTSUCHACB.LONG  = 0;
    CTSU.CTSUCHTRCA.LONG = 0;
    CTSU.CTSUCHTRCB.LONG = 0;

    CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_0;
    CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1;
    CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_2;
    CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_3;

    /* LDO Nch setting (40uAmode) */
    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCALIB.BIT.TSOC = 1;
    CTSU.CTSUCRA.BIT.ATUNE1 = 1;
    CTSU.CTSUCRA.BIT.ATUNE2 = 0;
    CTSU.CTSUCRA.BIT.LOAD   = 3;

    /* DAC initial setting */
    CTSU.CTSUCALIB.BIT.DACMSEL  = 1;
    CTSU.CTSUCALIB.BIT.DACCARRY = 1;

    if (15 >= g_ctsu_diag_info.loop_count)
    {
        /* Upper Current source setting (10uA) */
        CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_0;
        CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1;

        switch (g_ctsu_diag_info.loop_count)
        {
            case 0:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_0BIT;
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_3;

                /* Setting time of measurement */
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 1:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_1BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 2:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_2BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 3:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_3BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 4:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_4BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 5:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_5BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 6:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_6BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 7:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2 + CTSU_DIAG_DAC_7BIT;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
                break;
            }

            case 8:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_0BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_0BIT);
                break;
            }

            case 9:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_1BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 10:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_2BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_2BIT);
                break;
            }

            case 11:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_3BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_3BIT);
                break;
            }

            case 12:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_4BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_4BIT);
                break;
            }

            case 13:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_5BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_5BIT);
                break;
            }

            case 14:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_6BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_6BIT);
                break;
            }

            case 15:
            {
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
                CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_7BIT;
                g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) |
                                                 (CTSU_DIAG_DAC_INIT_3 + CTSU_DIAG_DAC_7BIT);
                break;
            }
        }
    }

