xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
    if (16 <= g_ctsu_diag_info.loop_count)
    {
        /* Lower Current source setting (10uA) */
        switch (g_ctsu_diag_info.loop_count)
        {
            case 16:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0;
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1;
                break;
            }

            case 17:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - CTSU_DIAG_DAC_0BIT;
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + CTSU_DIAG_DAC_0BIT;
                break;
            }

            case 18:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 19:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_1BIT + CTSU_DIAG_DAC_2BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 20:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_2BIT + CTSU_DIAG_DAC_3BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 21:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_3BIT + CTSU_DIAG_DAC_4BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 22:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_4BIT + CTSU_DIAG_DAC_5BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 23:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_5BIT + CTSU_DIAG_DAC_6BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 24:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - (CTSU_DIAG_DAC_6BIT + CTSU_DIAG_DAC_7BIT);
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + (CTSU_DIAG_DAC_0BIT + CTSU_DIAG_DAC_1BIT);
                break;
            }

            case 25:
            {
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_DATA_MAX_0 - CTSU_DIAG_DAC_7BIT;
                CTSU.CTSUSO.LONG = CTSU_DIAG_DAC_INIT_1 + CTSU_DIAG_DAC_1BIT;
                break;
            }
        }

        CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_2;
        CTSU.CTSUSO.LONG                 = CTSU_DIAG_DAC_INIT_3;
        g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10) | CTSU_DIAG_DAC_INIT_3;
    }
}

static void ctsu_diag_current_source_data_get (void)
{
    g_ctsu_diag_info.current_source[g_ctsu_diag_info.loop_count] = (uint16_t) g_ctsu_diag_info.ctsuscnt[0];

    g_ctsu_diag_info.current_source[g_ctsu_diag_info.loop_count] =
        (uint16_t) ((((uint32_t) g_ctsu_diag_info.current_source[g_ctsu_diag_info.loop_count]) *
                     g_ctsu_diag_info.error_registance[2]) >> (CTSU_SHIFT_AMOUNT));

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 0)
    ctsu_correction_calc_t calc;
    calc.snum  = CTSU_SNUM_RECOMMEND;
    calc.range = CTSU_RANGE_40UA;
    calc.md    = CTSU_MODE_DIAGNOSIS_SCAN;
    ctsu_correction_calc(&g_ctsu_diag_info.current_source[g_ctsu_diag_info.loop_count],
                         g_ctsu_diag_info.current_source[g_ctsu_diag_info.loop_count],
                         &calc);
#endif

    g_ctsu_diag_info.loop_count++;
}

static fsp_err_t ctsu_diag_current_source_result (void)
{
    uint8_t  k;
    uint16_t current_source_diff;

    for (k = 0; k < (CTSU_DIAG_HIGH_CURRENT_SOURCE + CTSU_DIAG_LOW_CURRENT_SOURCE); k++)
    {
        current_source_diff = (uint16_t) (g_ctsu_diag_info.load_resistance[2] - g_ctsu_diag_info.current_source[k]);
        if ((current_source_diff < CTSU_CFG_DIAG_CURRENT_SOURCE_DIFF_MAX) &&
            (current_source_diff > CTSU_CFG_DIAG_CURRENT_SOURCE_DIFF_MIN))
        {
        }
        else
        {
            return FSP_ERR_CTSU_DIAG_CURRENT_SOURCE;
        }
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_cco_gain_scan_start (void)
{
    /* CTSU Setting */
    CTSU.CTSUCRA.BIT.MD0    = 0;
    CTSU.CTSUCRA.BIT.MD1    = 0;
    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCRA.BIT.PON    = 1;
    CTSU.CTSUCRA.BIT.CSW    = 1;
    CTSU.CTSUCRA.BIT.PUMPON = 1;

    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 0;
    CTSU.CTSUMCH.BIT.MCA2 = 0;
    CTSU.CTSUMCH.BIT.MCA3 = 0;

    CTSU.CTSUCRB.BIT.SSMOD = 4;
    CTSU.CTSUCRB.BIT.SSCNT = 0;
    CTSU.CTSUCRB.BIT.SST   = CTSU_SST_RECOMMEND;

    CTSU.CTSUCRA.BIT.PCSEL  = 1;
    CTSU.CTSUCRA.BIT.SDPSEL = 1;

    CTSU.CTSUCALIB.LONG        = 0;
    CTSU.CTSUCALIB.BIT.SUCARRY = 0;

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
   /* Sensor counter auto correction enabled */
   CTSU.CTSUOPT.BIT.CCOCFEN = 0;
#endif

    if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
    {
        CTSU.CTSUCALIB.BIT.CCOCALIB = 1;
    }

    if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
    {
        CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
    }

    CTSU.CTSUCALIB.BIT.CCOCLK = 0;

    CTSU.CTSUCHACA.LONG  = 1;
    CTSU.CTSUCHACB.LONG  = 0;
    CTSU.CTSUCHTRCA.LONG = 0;
    CTSU.CTSUCHTRCB.LONG = 0;

    /* Setting time of measurement */
    g_ctsu_diag_info.ctsuwr.ctsuso = (CTSU_SNUM_RECOMMEND << 10);

    CTSU.CTSUMCH.BIT.MCH0 = 0;

    if (g_ctsu_diag_info.loop_count < 8)
    {
        CTSU.CTSUSUCLKA.BIT.SUADJ0   = (0x1f + (g_ctsu_diag_info.loop_count * CTSU_DIAG_SUCLK0_REG2));
    }
    else if ((8 <= g_ctsu_diag_info.loop_count) && (g_ctsu_diag_info.loop_count < 11))
    {
        CTSU.CTSUSUCLKA.BIT.SUADJ0   = (0x1f + (7 * CTSU_DIAG_SUCLK0_REG2));
        if (8 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 0;
        }
        else if (9 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 1;
        }
        else if (10 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 2;
        }
        else
        {
        }

        CTSU.CTSUCALIB.BIT.SUCARRY = 0;
        if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
        {
            CTSU.CTSUCALIB.BIT.CCOCALIB = 1;
        }

        if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
        {
            CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
        }

        CTSU.CTSUCALIB.BIT.CCOCLK = 0;
        CTSU.CTSUCRB.BIT.SSMOD    = 1;
        CTSU.CTSUCRB.BIT.SST      = CTSU_SST_RECOMMEND_CURRENT;
        if (8 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 1;
        }
        else if (9 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 2;
        }
        else if (10 == g_ctsu_diag_info.loop_count)
        {
            CTSU.CTSUCRB.BIT.SSCNT = 3;
        }
        else
        {
        }
    }
    else if (11 == g_ctsu_diag_info.loop_count)
    {
        CTSU.CTSUSUCLKA.BIT.SUADJ0   = (0x1f + (7 * CTSU_DIAG_SUCLK0_REG2));

        CTSU.CTSUCRB.BIT.SSCNT     = 2;
        CTSU.CTSUCALIB.BIT.SUCARRY = 1;
        if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
        {
            CTSU.CTSUCALIB.BIT.CCOCALIB = 1;
        }

        if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
        {
            CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
        }

        CTSU.CTSUCALIB.BIT.CCOCLK = 0;
        CTSU.CTSUCRB.BIT.SSMOD    = 1;
        CTSU.CTSUCRB.BIT.SST      = CTSU_SST_RECOMMEND_CURRENT;
        CTSU.CTSUCRB.BIT.SSCNT    = 3;
    }
    else
    {
    }
}

static void ctsu_diag_cco_gain_data_get (void)
{
    if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
    {
        g_ctsu_diag_info.sensclk_cnt[g_ctsu_diag_info.loop_count] = (uint16_t) g_ctsu_diag_info.ctsuscnt[0];
    }

    if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
    {
        g_ctsu_diag_info.suclk_cnt[g_ctsu_diag_info.loop_count] = (uint16_t) (g_ctsu_diag_info.ctsuscnt[0] >> 16);
    }

    g_ctsu_diag_info.loop_count++;

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
   /* Sensor counter auto correction enabled */
   CTSU.CTSUOPT.BIT.CCOCFEN = 1;
#endif

