xlloss/RX140_64_KIT/src/smc_gen/r_ctsu_qe/src/r_ctsu_qe.c
}

static fsp_err_t ctsu_diag_cco_gain_result (void)
{
    uint32_t          k;
    volatile uint16_t cco_gain_data;
    uint16_t          cco_gain_data_pre;
    uint16_t          cco_gain_diff;
    uint16_t          cco_gain_max;
    uint16_t          cco_gain_min;
    uint16_t          cco_gain_diff_max;
    uint16_t          cco_gain_diff_min;

    /* read counter data */
    for (k = 0; k < CTSU_CORRECTION_POINT_NUM; k++)
    {
        if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
        {
            cco_gain_data = g_ctsu_diag_info.sensclk_cnt[k];
        }

        if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
        {
            cco_gain_data = g_ctsu_diag_info.suclk_cnt[k];
        }

        cco_gain_max = cco_gain_table[k][1];
        cco_gain_min = cco_gain_table[k][0];

        /* check measurement result */
        if ((cco_gain_data <= cco_gain_max) && (cco_gain_data >= cco_gain_min))
        {
        }
        else
        {
            if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
            {
                return FSP_ERR_CTSU_DIAG_SENSCLK_GAIN;
            }

            if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
            {
                return FSP_ERR_CTSU_DIAG_SUCLK_GAIN;
            }
        }

        if (0 < k)
        {
            cco_gain_diff_max = cco_gain_diff_table[k - 1][1];
            cco_gain_diff_min = cco_gain_diff_table[k - 1][0];

            if (cco_gain_data > cco_gain_data_pre)
            {
                cco_gain_diff = (uint16_t) (cco_gain_data - cco_gain_data_pre);
            }
            else
            {
                cco_gain_diff = (uint16_t) (cco_gain_data_pre - cco_gain_data);
            }

            /* check measurement result */
            if ((cco_gain_diff > cco_gain_diff_max) || (cco_gain_diff < cco_gain_diff_min))
            {
                if (CTSU_DIAG_SENSCLK == g_ctsu_diag_info.state)
                {
                    return FSP_ERR_CTSU_DIAG_SENSCLK_GAIN;
                }

                if (CTSU_DIAG_SUCLK == g_ctsu_diag_info.state)
                {
                    return FSP_ERR_CTSU_DIAG_SUCLK_GAIN;
                }
            }
        }

        cco_gain_data_pre = cco_gain_data;
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

static void ctsu_diag_clock_recovery_scan_start (void)
{
    CTSU.CTSUCRA.LONG           = g_ctsu_diag_reg.ctsucra;
    CTSU.CTSUCRA.BIT.MD0        = 1;
    CTSU.CTSUCRA.BIT.MD1        = 0;
    CTSU.CTSUMCH.LONG           = g_ctsu_diag_reg.ctsumch;
    CTSU.CTSUCRB.LONG           = g_ctsu_diag_reg.ctsucrb;
    CTSU.CTSUCRA.BIT.LOAD       = 1;
    CTSU.CTSUCRB.BIT.SSCNT      = 1;
    CTSU.CTSUCALIB.BIT.SUCARRY  = 0;
    CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
    CTSU.CTSUCALIB.BIT.CCOCLK   = 1;
    CTSU.CTSUCALIB.BIT.TSOC     = 0;
    CTSU.CTSUCALIB.BIT.SUCLKEN  = 1;

    CTSU.CTSUCRA.BIT.SDPSEL = 0;
    CTSU.CTSUSUCLKA.LONG    = g_ctsu_diag_reg.ctsusuclka;
    CTSU.CTSUSUCLKB.LONG    = g_ctsu_diag_reg.ctsusuclkb;
    CTSU.CTSUCRA.BIT.SDPSEL = 1;

    CTSU.CTSUMCH.BIT.MCA0 = 1;
    CTSU.CTSUMCH.BIT.MCA1 = 1;
    CTSU.CTSUMCH.BIT.MCA2 = 1;
    CTSU.CTSUMCH.BIT.MCA3 = 0;

    CTSU.CTSUCHACA.LONG  = g_ctsu_diag_info.chaca;
    CTSU.CTSUCHACB.LONG  = g_ctsu_diag_info.chacb;
    CTSU.CTSUCHTRCA.LONG = 0;
    CTSU.CTSUCHTRCB.LONG = 0;

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
   /* Sensor counter auto correction enabled */
   CTSU.CTSUOPT.BIT.CCOCFEN = 0;
#endif

    /* Setting time of measurement */

    g_ctsu_diag_info.ctsuwr.ctsuso = (uint32_t) ((0xf << 24) | (CTSU_SNUM_RECOMMEND << 10));
}

static void ctsu_diag_clock_recovery_data_get (void)
{
    uint8_t i;
    for (i = 0; i < 3; i++)
    {
        g_ctsu_diag_info.suclk_count_clk_recv[i] = (uint16_t) (g_ctsu_diag_info.ctsuscnt[i] >> 16);
    }

#if (CTSU_CFG_AUTO_CORRECTION_ENABLE == 1)
   /* Sensor counter auto correction enabled */
   CTSU.CTSUOPT.BIT.CCOCFEN = 1;
#endif
}

static fsp_err_t ctsu_diag_clock_recovery_result (void)
{
    uint8_t         i;
    uint32_t        suclk[3];
    static uint32_t suclk_cnt[3];

    suclk[0] = (CTSU_DIAG_STCLK_FREQ * (CTSU_CFG_SUMULTI0 + 1));
    suclk[1] = (CTSU_DIAG_STCLK_FREQ * (CTSU_CFG_SUMULTI1 + 1));
    suclk[2] = (CTSU_DIAG_STCLK_FREQ * (CTSU_CFG_SUMULTI2 + 1));

    for (i = 0; i < 3; i++)
    {
        suclk_cnt[i % 3] = ((suclk[i % 3] * (CTSU_SNUM_RECOMMEND + 1)) / CTSU_DIAG_STCLK_FREQ) * 8 * 2;

        /* suclk check */
        if ((suclk_cnt[i % 3] + CTSU_CFG_DIAG_CLOCK_RECOV_RANGE) < g_ctsu_diag_info.suclk_count_clk_recv[i])
        {
            return FSP_ERR_CTSU_DIAG_CLOCK_RECOVERY;
        }

        if ((suclk_cnt[i % 3] - CTSU_CFG_DIAG_CLOCK_RECOV_RANGE) > g_ctsu_diag_info.suclk_count_clk_recv[i])
        {
            return FSP_ERR_CTSU_DIAG_CLOCK_RECOVERY;
        }
    }

    /* if all checks passed to this point, return success */
    return FSP_SUCCESS;
}

  #if (CTSU_CFG_NUM_CFC != 0)
static void ctsu_diag_cfc_gain_scan_start (void)
{
    /* CTSU Setting */
    CTSU.CTSUCRA.BIT.MD0    = 1;
    CTSU.CTSUCRA.BIT.MD1    = 0;
    CTSU.CTSUMCH.BIT.MCA0   = 1;
    CTSU.CTSUMCH.BIT.MCA1   = 0;
    CTSU.CTSUMCH.BIT.MCA2   = 0;
    CTSU.CTSUMCH.BIT.MCA3   = 0;
    CTSU.CTSUCRA.BIT.LOAD   = 1;
    CTSU.CTSUCRA.BIT.CFCON  = 1;
    CTSU.CTSUCRA.BIT.PUMPON = 1;
    CTSU.CTSUCRA.BIT.TXVSEL = 1;

    CTSU.CTSUCRB.BIT.SSMOD = 0;
    CTSU.CTSUCRB.BIT.SSCNT = 0;
    CTSU.CTSUCRB.BIT.SST   = 0x1F;

    CTSU.CTSUCRA.BIT.PCSEL  = 1;
    CTSU.CTSUCRA.BIT.SDPSEL = 1;

    CTSU.CTSUCALIB            = 0;
    CTSU.CTSUCALIB.BIT.SUCARRY  = 0;
    CTSU.CTSUCALIB.BIT.CCOCALIB = 0;
    CTSU.CTSUCALIB.BIT.CCOCLK   = 0;
    CTSU.CTSUCALIB.BIT.CFCMODE  = 1;
    CTSU.CTSUCALIB.BIT.CFCRDMD  = 1;

    if (CTSU_DIAG_CHACA_TSMAX > g_ctsu_corrcfc_info.ts_table[0])
    {
        CTSU.CTSUCHACA.LONG = (uint32_t) (1 << g_ctsu_corrcfc_info.ts_table[0]);
        CTSU.CTSUCHACB.LONG = 0;
    }
    else
    {
        CTSU.CTSUCHACA.LONG = 0;
        CTSU.CTSUCHACB.LONG = (uint32_t) (1 << (g_ctsu_corrcfc_info.ts_table[0] - CTSU_DIAG_CHACA_TSMAX));
    }

    CTSU.CTSUCHTRC0 = 0;
    CTSU.CTSUCHTRC1 = 0;
    CTSU.CTSUCHTRC2 = 0;
    CTSU.CTSUCHTRC3 = 0;
    CTSU.CTSUCHTRC4 = 0;

    CTSU.CTSUMCH.BIT.MCH0 = 0;

    CTSU.CTSUCRA.BIT.SDPSEL = 0;
    CTSU.CTSUSUCLK0       =
        (uint16_t) (((g_ctsu_diag_info.loop_count + CTSU_CORRCFC_CENTER_POINT) * CTSU_CORRECTION_SUMULTI) - 1);
    CTSU.CTSUCRA.BIT.SDPSEL = 1;

    g_ctsu_diag_info.ctsuwr.ctsuso = (uint32_t) (CTSU_SNUM_RECOMMEND << 10);
}

static void ctsu_diag_cfc_gain_data_get (void)
{
    g_ctsu_diag_info.cfc_cnt[g_ctsu_diag_info.loop_count] = (uint16_t) g_ctsu_diag_info.ctsuscnt[0];

    g_ctsu_diag_info.loop_count++;
}

static fsp_err_t ctsu_diag_cfc_gain_result (void)
{
    uint8_t k;

    for (k = 0; k < (CTSU_CORRCFC_POINT_NUM - 1); k++)
    {
        if (g_ctsu_diag_info.cfc_cnt[k + 1] > g_ctsu_diag_info.cfc_cnt[k])
        {
            /* PASS */
        }
        else
        {

            /* FAIL */
            return FSP_ERR_CTSU_DIAG_CFC_GAIN;
        }
    }

    return FSP_SUCCESS;
}

  #endif
 #endif
#endif
